; ModuleID = 'anchor_spl.163986ce-cgu.0'
source_filename = "anchor_spl.163986ce-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"anchor_lang::prelude::Pubkey" = type { [32 x i8] }
%"std::result::Result<token::InitializeMint, anchor_lang::error::Error>" = type { i64, [14 x i64] }
%"std::result::Result<std::convert::Infallible, anchor_lang::error::Error>::Err" = type { %"anchor_lang::error::Error" }
%"anchor_lang::error::Error" = type { i64, [13 x i64] }
%"std::result::Result<token::InitializeMint, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::ThawAccount, anchor_lang::error::Error>" = type { i64, [18 x i64] }
%"std::result::Result<token::ThawAccount, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::InitializeAccount, anchor_lang::error::Error>" = type { i64, [24 x i64] }
%"std::result::Result<token::InitializeAccount, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::CloseAccount, anchor_lang::error::Error>" = type { i64, [18 x i64] }
%"std::result::Result<token::CloseAccount, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::Burn, anchor_lang::error::Error>" = type { i64, [18 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN10anchor_spl4mint3srm2ID17h322e4877e8958892E", scope: !2, file: !5, line: 6, type: !6, isLocal: false, isDefinition: true, align: 1)
!2 = !DINamespace(name: "srm", scope: !3)
!3 = !DINamespace(name: "mint", scope: !4)
!4 = !DINamespace(name: "anchor_spl", scope: null)
!5 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.22.0/src/mint.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.22.0", checksumkind: CSK_MD5, checksum: "911e6cf7a437f47aba27e6c240fc562a")
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pubkey", scope: !8, file: !7, size: 256, align: 8, elements: !10, templateParams: !16, identifier: "f73e4605b437c79ed91db8762ecd77ed")
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "pubkey", scope: !9)
!9 = !DINamespace(name: "solana_program", scope: null)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !6, file: !7, baseType: !12, size: 256, align: 8)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, align: 8, elements: !14)
!13 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DISubrange(count: 32, lowerBound: 0)
!16 = !{}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN10anchor_spl4mint4usdc2ID17h80cfe134fba4d55dE", scope: !19, file: !5, line: 12, type: !6, isLocal: false, isDefinition: true, align: 1)
!19 = !DINamespace(name: "usdc", scope: !3)
!20 = !{i32 7, !"PIC Level", i32 2}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !23, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, globals: !39)
!23 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.22.0/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.22.0")
!24 = !{!25, !32}
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AccountState", scope: !26, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !28)
!26 = !DINamespace(name: "state", scope: !27)
!27 = !DINamespace(name: "spl_token", scope: null)
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "Initialized", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Frozen", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AuthorityType", scope: !33, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !34)
!33 = !DINamespace(name: "instruction", scope: !27)
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "MintTokens", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "FreezeAccount", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "AccountOwner", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "CloseAccount", value: 3, isUnsigned: true)
!39 = !{!0, !17}
!40 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::InitializeMint, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h256c6c4e4a07137bE", scope: !42, file: !41, line: 1913, type: !45, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !323, retainedNodes: !319)
!41 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "f73030f150a3926f0f5a346ed13cef73")
!42 = !DINamespace(name: "{impl#37}", scope: !43)
!43 = !DINamespace(name: "result", scope: !44)
!44 = !DINamespace(name: "core", scope: null)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !305}
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::InitializeMint, anchor_lang::error::Error>", scope: !43, file: !7, size: 960, align: 64, elements: !48, identifier: "6afecf74aa340b7221aba926d0aca8cd")
!48 = !{!49}
!49 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 960, align: 64, elements: !50, templateParams: !158, identifier: "6afecf74aa340b7221aba926d0aca8cd_variant_part", discriminator: !304)
!50 = !{!51, !300}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !49, file: !7, baseType: !52, size: 960, align: 64, extraData: i64 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !47, file: !7, size: 960, align: 64, elements: !53, templateParams: !158, identifier: "6afecf74aa340b7221aba926d0aca8cd::Ok")
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !52, file: !7, baseType: !55, size: 768, align: 64, offset: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "InitializeMint", scope: !56, file: !7, size: 768, align: 64, elements: !57, templateParams: !16, identifier: "ec1e7eaef5b2183a4dbc9c780a422d04")
!56 = !DINamespace(name: "token", scope: !4)
!57 = !{!58, !157}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !55, file: !7, baseType: !59, size: 384, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountInfo", scope: !60, file: !7, size: 384, align: 64, elements: !61, templateParams: !16, identifier: "e78f2b0dc7d2189d2e75b13823b0fc55")
!60 = !DINamespace(name: "account_info", scope: !9)
!61 = !{!62, !64, !66, !67, !121, !154, !155, !156}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !59, file: !7, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Pubkey", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "is_signer", scope: !59, file: !7, baseType: !65, size: 8, align: 8, offset: 320)
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !59, file: !7, baseType: !65, size: 8, align: 8, offset: 328)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lamports", scope: !59, file: !7, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut u64>>", scope: !69, file: !7, size: 64, align: 64, elements: !71, templateParams: !114, identifier: "6ef7b15072feeefd759461885cf3019e")
!69 = !DINamespace(name: "rc", scope: !70)
!70 = !DINamespace(name: "alloc", scope: null)
!71 = !{!72, !118}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !68, file: !7, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !74, file: !7, size: 64, align: 64, elements: !76, templateParams: !116, identifier: "d2d32bd76a770e3b785a79f0ea18809c")
!74 = !DINamespace(name: "non_null", scope: !75)
!75 = !DINamespace(name: "ptr", scope: !44)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !73, file: !7, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut u64>>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut u64>>", scope: !69, file: !7, size: 256, align: 64, elements: !80, templateParams: !114, identifier: "cd940ff313dfbf2c8cc0f66ebb255962")
!80 = !{!81, !92, !93}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !79, file: !7, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !83, file: !7, size: 64, align: 64, elements: !84, templateParams: !90, identifier: "d610ccc56ed6bc2d95c5846672673907")
!83 = !DINamespace(name: "cell", scope: !44)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !82, file: !7, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !83, file: !7, size: 64, align: 64, elements: !87, templateParams: !90, identifier: "df37019b130d2c01fbc34865afbd6522")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !7, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !89)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !79, file: !7, baseType: !82, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !7, baseType: !94, size: 128, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut u64>", scope: !83, file: !7, size: 128, align: 64, elements: !95, templateParams: !112, identifier: "7d2673a3f332cc6d0037c3d8efd0c31")
!95 = !{!96, !106}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !94, file: !7, baseType: !97, size: 64, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !83, file: !7, size: 64, align: 64, elements: !98, templateParams: !104, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !97, file: !7, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !83, file: !7, size: 64, align: 64, elements: !101, templateParams: !104, identifier: "a478319df2321c642b07e6e189247bf")
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !7, baseType: !103, size: 64, align: 64)
!103 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !103)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !94, file: !7, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut u64>", scope: !83, file: !7, size: 64, align: 64, elements: !108, templateParams: !112, identifier: "fede724123caa5feb7f972fe06520498")
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !107, file: !7, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "T", type: !110)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !94)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "T", type: !79)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !68, file: !7, baseType: !119, align: 8)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !120, file: !7, align: 8, elements: !16, templateParams: !116, identifier: "b13e3795bbeaa5fcb9501203d2a3f0a3")
!120 = !DINamespace(name: "marker", scope: !44)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !7, baseType: !122, size: 64, align: 64, offset: 128)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut [u8]>>", scope: !69, file: !7, size: 64, align: 64, elements: !123, templateParams: !148, identifier: "3be54905e4a87e92cc158a3b6326395f")
!123 = !{!124, !152}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, file: !7, baseType: !125, size: 64, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !74, file: !7, size: 64, align: 64, elements: !126, templateParams: !150, identifier: "d4796e70143da55513d65b6d5d324f4e")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !125, file: !7, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut [u8]>>", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut [u8]>>", scope: !69, file: !7, size: 320, align: 64, elements: !130, templateParams: !148, identifier: "ec7aebffa1601b4d3001fa488717db04")
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !129, file: !7, baseType: !82, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !129, file: !7, baseType: !82, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !129, file: !7, baseType: !134, size: 192, align: 64, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut [u8]>", scope: !83, file: !7, size: 192, align: 64, elements: !135, templateParams: !146, identifier: "7b8d8c983afddbdb1c520939bc6434de")
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !134, file: !7, baseType: !97, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !7, baseType: !138, size: 128, align: 64, offset: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut [u8]>", scope: !83, file: !7, size: 128, align: 64, elements: !139, templateParams: !146, identifier: "832d880ad3cb9da2c7f8e74d7eb471dc")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !138, file: !7, baseType: !141, size: 128, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !7, size: 128, align: 64, elements: !142, templateParams: !16, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !141, file: !7, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !7, baseType: !89, size: 64, align: 64, offset: 64)
!146 = !{!147}
!147 = !DITemplateTypeParameter(name: "T", type: !141)
!148 = !{!149}
!149 = !DITemplateTypeParameter(name: "T", type: !134)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "T", type: !129)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !122, file: !7, baseType: !153, align: 8)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !120, file: !7, align: 8, elements: !16, templateParams: !150, identifier: "be8bb6f9922b714c56ddf772f9c2429f")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !59, file: !7, baseType: !63, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !59, file: !7, baseType: !65, size: 8, align: 8, offset: 336)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rent_epoch", scope: !59, file: !7, baseType: !111, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !55, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!158 = !{!159, !160}
!159 = !DITemplateTypeParameter(name: "T", type: !55)
!160 = !DITemplateTypeParameter(name: "E", type: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !162, file: !7, size: 896, align: 64, elements: !164, identifier: "327d78c495228fd8dc27450c66ad80ee")
!162 = !DINamespace(name: "error", scope: !163)
!163 = !DINamespace(name: "anchor_lang", scope: null)
!164 = !{!165}
!165 = !DICompositeType(tag: DW_TAG_variant_part, scope: !162, file: !7, size: 896, align: 64, elements: !166, templateParams: !16, identifier: "327d78c495228fd8dc27450c66ad80ee_variant_part", discriminator: !299)
!166 = !{!167, !240}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "AnchorError", scope: !165, file: !7, baseType: !168, size: 896, align: 64, extraData: i64 0)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnchorError", scope: !161, file: !7, size: 896, align: 64, elements: !169, templateParams: !16, identifier: "327d78c495228fd8dc27450c66ad80ee::AnchorError")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !7, baseType: !171, size: 832, align: 64, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnchorError", scope: !162, file: !7, size: 832, align: 64, elements: !172, templateParams: !16, identifier: "92464b7d2c8932cfedaa01697ee570e")
!172 = !{!173, !201, !203, !204, !227}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "error_name", scope: !171, file: !7, baseType: !174, size: 192, align: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !175, file: !7, size: 192, align: 64, elements: !176, templateParams: !16, identifier: "96eaa147e4cb6ee42e5dcd78906547cd")
!175 = !DINamespace(name: "string", scope: !70)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !174, file: !7, baseType: !178, size: 192, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !179, file: !7, size: 192, align: 64, elements: !180, templateParams: !198, identifier: "56aa0380f8224c92be7dc99cfce9180f")
!179 = !DINamespace(name: "vec", scope: !70)
!180 = !{!181, !200}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !178, file: !7, baseType: !182, size: 128, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !183, file: !7, size: 128, align: 64, elements: !184, templateParams: !198, identifier: "47ed2282bf82d40f2b2c1ebc77e9f331")
!183 = !DINamespace(name: "raw_vec", scope: !70)
!184 = !{!185, !194, !195}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !182, file: !7, baseType: !186, size: 64, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !187, file: !7, size: 64, align: 64, elements: !188, templateParams: !192, identifier: "76ad11c5918345b022d81965d637386")
!187 = !DINamespace(name: "unique", scope: !75)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !186, file: !7, baseType: !144, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !186, file: !7, baseType: !191, align: 8)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !120, file: !7, align: 8, elements: !16, templateParams: !192, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "T", type: !13)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !182, file: !7, baseType: !89, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !182, file: !7, baseType: !196, align: 8)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !197, file: !7, align: 8, elements: !16, templateParams: !16, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!197 = !DINamespace(name: "alloc", scope: !70)
!198 = !{!193, !199}
!199 = !DITemplateTypeParameter(name: "A", type: !196)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !178, file: !7, baseType: !89, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "error_code_number", scope: !171, file: !7, baseType: !202, size: 32, align: 32, offset: 768)
!202 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "error_msg", scope: !171, file: !7, baseType: !174, size: 192, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !171, file: !7, baseType: !205, size: 192, align: 64, offset: 384)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<anchor_lang::error::Source>", scope: !206, file: !7, size: 192, align: 64, elements: !207, identifier: "acaadf8bd7f9a531ebe38fd65ce79249")
!206 = !DINamespace(name: "option", scope: !44)
!207 = !{!208}
!208 = !DICompositeType(tag: DW_TAG_variant_part, scope: !206, file: !7, size: 192, align: 64, elements: !209, templateParams: !212, identifier: "acaadf8bd7f9a531ebe38fd65ce79249_variant_part", discriminator: !226)
!209 = !{!210, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !208, file: !7, baseType: !211, size: 192, align: 64, extraData: i64 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !205, file: !7, size: 192, align: 64, elements: !16, templateParams: !212, identifier: "acaadf8bd7f9a531ebe38fd65ce79249::None")
!212 = !{!213}
!213 = !DITemplateTypeParameter(name: "T", type: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source", scope: !162, file: !7, size: 192, align: 64, elements: !215, templateParams: !16, identifier: "70f38dd5e6dfa3f0129899250c0afbae")
!215 = !{!216, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !214, file: !7, baseType: !217, size: 128, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !218, templateParams: !16, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !217, file: !7, baseType: !144, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !217, file: !7, baseType: !89, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !214, file: !7, baseType: !202, size: 32, align: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !208, file: !7, baseType: !223, size: 192, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !205, file: !7, size: 192, align: 64, elements: !224, templateParams: !212, identifier: "acaadf8bd7f9a531ebe38fd65ce79249::Some")
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !223, file: !7, baseType: !214, size: 192, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, scope: !206, file: !7, baseType: !111, size: 64, align: 64, flags: DIFlagArtificial)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "account_name", scope: !171, file: !7, baseType: !228, size: 192, align: 64, offset: 576)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !206, file: !7, size: 192, align: 64, elements: !229, identifier: "928d549314dd3f53d1e9214fcd617748")
!229 = !{!230}
!230 = !DICompositeType(tag: DW_TAG_variant_part, scope: !206, file: !7, size: 192, align: 64, elements: !231, templateParams: !234, identifier: "928d549314dd3f53d1e9214fcd617748_variant_part", discriminator: !226)
!231 = !{!232, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !230, file: !7, baseType: !233, size: 192, align: 64, extraData: i64 0)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !228, file: !7, size: 192, align: 64, elements: !16, templateParams: !234, identifier: "928d549314dd3f53d1e9214fcd617748::None")
!234 = !{!235}
!235 = !DITemplateTypeParameter(name: "T", type: !174)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !230, file: !7, baseType: !237, size: 192, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !228, file: !7, size: 192, align: 64, elements: !238, templateParams: !234, identifier: "928d549314dd3f53d1e9214fcd617748::Some")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !237, file: !7, baseType: !174, size: 192, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ProgramError", scope: !165, file: !7, baseType: !241, size: 896, align: 64, extraData: i64 1)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !161, file: !7, size: 896, align: 64, elements: !242, templateParams: !16, identifier: "327d78c495228fd8dc27450c66ad80ee::ProgramError")
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !241, file: !7, baseType: !244, size: 640, align: 64, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramErrorWithOrigin", scope: !162, file: !7, size: 640, align: 64, elements: !245, templateParams: !16, identifier: "7d10ea25249fd0c1378178298b22869d")
!245 = !{!246, !297, !298}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "program_error", scope: !244, file: !7, baseType: !247, size: 256, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !248, file: !7, size: 256, align: 64, elements: !249, identifier: "45ddf68755c16608c41374fa68b0db07")
!248 = !DINamespace(name: "program_error", scope: !9)
!249 = !{!250}
!250 = !DICompositeType(tag: DW_TAG_variant_part, scope: !248, file: !7, size: 256, align: 64, elements: !251, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07_variant_part", discriminator: !296)
!251 = !{!252, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !286, !288, !290, !292, !294}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !250, file: !7, baseType: !253, size: 256, align: 64, extraData: i64 0)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !247, file: !7, size: 256, align: 64, elements: !254, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::Custom")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !253, file: !7, baseType: !202, size: 32, align: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidArgument", scope: !250, file: !7, baseType: !257, size: 256, align: 64, extraData: i64 1)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidArgument", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::InvalidArgument")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidInstructionData", scope: !250, file: !7, baseType: !259, size: 256, align: 64, extraData: i64 2)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidInstructionData", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::InvalidInstructionData")
!260 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidAccountData", scope: !250, file: !7, baseType: !261, size: 256, align: 64, extraData: i64 3)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidAccountData", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::InvalidAccountData")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "AccountDataTooSmall", scope: !250, file: !7, baseType: !263, size: 256, align: 64, extraData: i64 4)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountDataTooSmall", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::AccountDataTooSmall")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "InsufficientFunds", scope: !250, file: !7, baseType: !265, size: 256, align: 64, extraData: i64 5)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "InsufficientFunds", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::InsufficientFunds")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "IncorrectProgramId", scope: !250, file: !7, baseType: !267, size: 256, align: 64, extraData: i64 6)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "IncorrectProgramId", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::IncorrectProgramId")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "MissingRequiredSignature", scope: !250, file: !7, baseType: !269, size: 256, align: 64, extraData: i64 7)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "MissingRequiredSignature", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::MissingRequiredSignature")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAlreadyInitialized", scope: !250, file: !7, baseType: !271, size: 256, align: 64, extraData: i64 8)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountAlreadyInitialized", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::AccountAlreadyInitialized")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "UninitializedAccount", scope: !250, file: !7, baseType: !273, size: 256, align: 64, extraData: i64 9)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "UninitializedAccount", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::UninitializedAccount")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "NotEnoughAccountKeys", scope: !250, file: !7, baseType: !275, size: 256, align: 64, extraData: i64 10)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotEnoughAccountKeys", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::NotEnoughAccountKeys")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "AccountBorrowFailed", scope: !250, file: !7, baseType: !277, size: 256, align: 64, extraData: i64 11)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountBorrowFailed", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::AccountBorrowFailed")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSeedLengthExceeded", scope: !250, file: !7, baseType: !279, size: 256, align: 64, extraData: i64 12)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSeedLengthExceeded", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::MaxSeedLengthExceeded")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidSeeds", scope: !250, file: !7, baseType: !281, size: 256, align: 64, extraData: i64 13)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidSeeds", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::InvalidSeeds")
!282 = !DIDerivedType(tag: DW_TAG_member, name: "BorshIoError", scope: !250, file: !7, baseType: !283, size: 256, align: 64, extraData: i64 14)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorshIoError", scope: !247, file: !7, size: 256, align: 64, elements: !284, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::BorshIoError")
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !283, file: !7, baseType: !174, size: 192, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "AccountNotRentExempt", scope: !250, file: !7, baseType: !287, size: 256, align: 64, extraData: i64 15)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountNotRentExempt", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::AccountNotRentExempt")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedSysvar", scope: !250, file: !7, baseType: !289, size: 256, align: 64, extraData: i64 16)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsupportedSysvar", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::UnsupportedSysvar")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "IllegalOwner", scope: !250, file: !7, baseType: !291, size: 256, align: 64, extraData: i64 17)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "IllegalOwner", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::IllegalOwner")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "AccountsDataBudgetExceeded", scope: !250, file: !7, baseType: !293, size: 256, align: 64, extraData: i64 18)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountsDataBudgetExceeded", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::AccountsDataBudgetExceeded")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveVoteAccountClose", scope: !250, file: !7, baseType: !295, size: 256, align: 64, extraData: i64 19)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActiveVoteAccountClose", scope: !247, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "45ddf68755c16608c41374fa68b0db07::ActiveVoteAccountClose")
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !7, baseType: !202, size: 32, align: 32, flags: DIFlagArtificial)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !244, file: !7, baseType: !205, size: 192, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "account_name", scope: !244, file: !7, baseType: !228, size: 192, align: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, scope: !162, file: !7, baseType: !111, size: 64, align: 64, flags: DIFlagArtificial)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !49, file: !7, baseType: !301, size: 960, align: 64, extraData: i64 1)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !47, file: !7, size: 960, align: 64, elements: !302, templateParams: !158, identifier: "6afecf74aa340b7221aba926d0aca8cd::Err")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !301, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !7, baseType: !111, size: 64, align: 64, flags: DIFlagArtificial)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, anchor_lang::error::Error>", scope: !43, file: !7, size: 896, align: 64, elements: !306, identifier: "6ff9d5fe7d13c618d90a4cb32731ca99")
!306 = !{!307}
!307 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 896, align: 64, elements: !308, templateParams: !313, identifier: "6ff9d5fe7d13c618d90a4cb32731ca99_variant_part")
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !307, file: !7, baseType: !310, size: 896, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !305, file: !7, size: 896, align: 64, elements: !311, templateParams: !313, identifier: "6ff9d5fe7d13c618d90a4cb32731ca99::Err")
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !310, file: !7, baseType: !161, size: 896, align: 64)
!313 = !{!314, !160}
!314 = !DITemplateTypeParameter(name: "T", type: !315)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !316, file: !7, align: 8, elements: !317, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!316 = !DINamespace(name: "convert", scope: !44)
!317 = !{!318}
!318 = !DICompositeType(tag: DW_TAG_variant_part, scope: !316, file: !7, align: 8, elements: !16, templateParams: !16, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!319 = !{!320, !321}
!320 = !DILocalVariable(name: "residual", arg: 1, scope: !40, file: !41, line: 1913, type: !305)
!321 = !DILocalVariable(name: "e", scope: !322, file: !41, line: 1915, type: !161, align: 8)
!322 = distinct !DILexicalBlock(scope: !40, file: !41, line: 1915, column: 13)
!323 = !{!159, !160, !324}
!324 = !DITemplateTypeParameter(name: "F", type: !161)
!325 = !DILocation(line: 1913, column: 22, scope: !40)
!326 = !DILocation(line: 1915, column: 17, scope: !322)
!327 = !DILocation(line: 1915, column: 17, scope: !40)
!328 = !DILocation(line: 1915, column: 38, scope: !322)
!329 = !DILocation(line: 1915, column: 27, scope: !322)
!330 = !DILocation(line: 1915, column: 23, scope: !322)
!331 = !DILocation(line: 1917, column: 6, scope: !40)
!332 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::ThawAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h404314469b87fdc0E", scope: !42, file: !41, line: 1913, type: !333, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !358, retainedNodes: !354)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !305}
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::ThawAccount, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !336, identifier: "2db3a136d6afcf721fc971dd22089257")
!336 = !{!337}
!337 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !338, templateParams: !348, identifier: "2db3a136d6afcf721fc971dd22089257_variant_part", discriminator: !304)
!338 = !{!339, !350}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !337, file: !7, baseType: !340, size: 1216, align: 64, extraData: i64 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !335, file: !7, size: 1216, align: 64, elements: !341, templateParams: !348, identifier: "2db3a136d6afcf721fc971dd22089257::Ok")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !340, file: !7, baseType: !343, size: 1152, align: 64, offset: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThawAccount", scope: !56, file: !7, size: 1152, align: 64, elements: !344, templateParams: !16, identifier: "2c912065c0cb630d6148a46b612c1e4")
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !343, file: !7, baseType: !59, size: 384, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !343, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !343, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!348 = !{!349, !160}
!349 = !DITemplateTypeParameter(name: "T", type: !343)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !337, file: !7, baseType: !351, size: 1216, align: 64, extraData: i64 1)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !335, file: !7, size: 1216, align: 64, elements: !352, templateParams: !348, identifier: "2db3a136d6afcf721fc971dd22089257::Err")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!354 = !{!355, !356}
!355 = !DILocalVariable(name: "residual", arg: 1, scope: !332, file: !41, line: 1913, type: !305)
!356 = !DILocalVariable(name: "e", scope: !357, file: !41, line: 1915, type: !161, align: 8)
!357 = distinct !DILexicalBlock(scope: !332, file: !41, line: 1915, column: 13)
!358 = !{!349, !160, !324}
!359 = !DILocation(line: 1913, column: 22, scope: !332)
!360 = !DILocation(line: 1915, column: 17, scope: !357)
!361 = !DILocation(line: 1915, column: 17, scope: !332)
!362 = !DILocation(line: 1915, column: 38, scope: !357)
!363 = !DILocation(line: 1915, column: 27, scope: !357)
!364 = !DILocation(line: 1915, column: 23, scope: !357)
!365 = !DILocation(line: 1917, column: 6, scope: !332)
!366 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::InitializeAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h594c13fc32211908E", scope: !42, file: !41, line: 1913, type: !367, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !393, retainedNodes: !389)
!367 = !DISubroutineType(types: !368)
!368 = !{!369, !305}
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::InitializeAccount, anchor_lang::error::Error>", scope: !43, file: !7, size: 1600, align: 64, elements: !370, identifier: "e0601f47e5a177d19183189159c71de9")
!370 = !{!371}
!371 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1600, align: 64, elements: !372, templateParams: !383, identifier: "e0601f47e5a177d19183189159c71de9_variant_part", discriminator: !304)
!372 = !{!373, !385}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !371, file: !7, baseType: !374, size: 1600, align: 64, extraData: i64 0)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !369, file: !7, size: 1600, align: 64, elements: !375, templateParams: !383, identifier: "e0601f47e5a177d19183189159c71de9::Ok")
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !374, file: !7, baseType: !377, size: 1536, align: 64, offset: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "InitializeAccount", scope: !56, file: !7, size: 1536, align: 64, elements: !378, templateParams: !16, identifier: "f6aad9e72ff208c0ce0267e707b7df5b")
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !377, file: !7, baseType: !59, size: 384, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !377, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !377, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !377, file: !7, baseType: !59, size: 384, align: 64, offset: 1152)
!383 = !{!384, !160}
!384 = !DITemplateTypeParameter(name: "T", type: !377)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !371, file: !7, baseType: !386, size: 1600, align: 64, extraData: i64 1)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !369, file: !7, size: 1600, align: 64, elements: !387, templateParams: !383, identifier: "e0601f47e5a177d19183189159c71de9::Err")
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !386, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "residual", arg: 1, scope: !366, file: !41, line: 1913, type: !305)
!391 = !DILocalVariable(name: "e", scope: !392, file: !41, line: 1915, type: !161, align: 8)
!392 = distinct !DILexicalBlock(scope: !366, file: !41, line: 1915, column: 13)
!393 = !{!384, !160, !324}
!394 = !DILocation(line: 1913, column: 22, scope: !366)
!395 = !DILocation(line: 1915, column: 17, scope: !392)
!396 = !DILocation(line: 1915, column: 17, scope: !366)
!397 = !DILocation(line: 1915, column: 38, scope: !392)
!398 = !DILocation(line: 1915, column: 27, scope: !392)
!399 = !DILocation(line: 1915, column: 23, scope: !392)
!400 = !DILocation(line: 1917, column: 6, scope: !366)
!401 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::CloseAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h5c19f241e895117dE", scope: !42, file: !41, line: 1913, type: !402, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !427, retainedNodes: !423)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !305}
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::CloseAccount, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !405, identifier: "8f209cc073e02e47f8a58a4a2c2e029a")
!405 = !{!406}
!406 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !407, templateParams: !417, identifier: "8f209cc073e02e47f8a58a4a2c2e029a_variant_part", discriminator: !304)
!407 = !{!408, !419}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !406, file: !7, baseType: !409, size: 1216, align: 64, extraData: i64 0)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !404, file: !7, size: 1216, align: 64, elements: !410, templateParams: !417, identifier: "8f209cc073e02e47f8a58a4a2c2e029a::Ok")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !7, baseType: !412, size: 1152, align: 64, offset: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "CloseAccount", scope: !56, file: !7, size: 1152, align: 64, elements: !413, templateParams: !16, identifier: "71f8bfe94d2542a47a586de204932d3")
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !412, file: !7, baseType: !59, size: 384, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !412, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !412, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!417 = !{!418, !160}
!418 = !DITemplateTypeParameter(name: "T", type: !412)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !406, file: !7, baseType: !420, size: 1216, align: 64, extraData: i64 1)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !404, file: !7, size: 1216, align: 64, elements: !421, templateParams: !417, identifier: "8f209cc073e02e47f8a58a4a2c2e029a::Err")
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !420, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!423 = !{!424, !425}
!424 = !DILocalVariable(name: "residual", arg: 1, scope: !401, file: !41, line: 1913, type: !305)
!425 = !DILocalVariable(name: "e", scope: !426, file: !41, line: 1915, type: !161, align: 8)
!426 = distinct !DILexicalBlock(scope: !401, file: !41, line: 1915, column: 13)
!427 = !{!418, !160, !324}
!428 = !DILocation(line: 1913, column: 22, scope: !401)
!429 = !DILocation(line: 1915, column: 17, scope: !426)
!430 = !DILocation(line: 1915, column: 17, scope: !401)
!431 = !DILocation(line: 1915, column: 38, scope: !426)
!432 = !DILocation(line: 1915, column: 27, scope: !426)
!433 = !DILocation(line: 1915, column: 23, scope: !426)
!434 = !DILocation(line: 1917, column: 6, scope: !401)
!435 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Burn, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h61accb0cd94a32fcE", scope: !42, file: !41, line: 1913, type: !436, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !461, retainedNodes: !457)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !305}
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Burn, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !439, identifier: "29d8c6e21c58a29cda581a798967b559")
!439 = !{!440}
!440 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !441, templateParams: !451, identifier: "29d8c6e21c58a29cda581a798967b559_variant_part", discriminator: !304)
!441 = !{!442, !453}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !440, file: !7, baseType: !443, size: 1216, align: 64, extraData: i64 0)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !438, file: !7, size: 1216, align: 64, elements: !444, templateParams: !451, identifier: "29d8c6e21c58a29cda581a798967b559::Ok")
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !443, file: !7, baseType: !446, size: 1152, align: 64, offset: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Burn", scope: !56, file: !7, size: 1152, align: 64, elements: !447, templateParams: !16, identifier: "446912df11c53f94dd00e57bc6c877d2")
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !446, file: !7, baseType: !59, size: 384, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !446, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !446, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!451 = !{!452, !160}
!452 = !DITemplateTypeParameter(name: "T", type: !446)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !440, file: !7, baseType: !454, size: 1216, align: 64, extraData: i64 1)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !438, file: !7, size: 1216, align: 64, elements: !455, templateParams: !451, identifier: "29d8c6e21c58a29cda581a798967b559::Err")
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!457 = !{!458, !459}
!458 = !DILocalVariable(name: "residual", arg: 1, scope: !435, file: !41, line: 1913, type: !305)
!459 = !DILocalVariable(name: "e", scope: !460, file: !41, line: 1915, type: !161, align: 8)
!460 = distinct !DILexicalBlock(scope: !435, file: !41, line: 1915, column: 13)
!461 = !{!452, !160, !324}
!462 = !DILocation(line: 1913, column: 22, scope: !435)
!463 = !DILocation(line: 1915, column: 17, scope: !460)
!464 = !DILocation(line: 1915, column: 17, scope: !435)
!465 = !DILocation(line: 1915, column: 38, scope: !460)
!466 = !DILocation(line: 1915, column: 27, scope: !460)
!467 = !DILocation(line: 1915, column: 23, scope: !460)
!468 = !DILocation(line: 1917, column: 6, scope: !435)
!469 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Transfer, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h6f84fac8587710a3E", scope: !42, file: !41, line: 1913, type: !470, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !495, retainedNodes: !491)
!470 = !DISubroutineType(types: !471)
!471 = !{!472, !305}
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Transfer, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !473, identifier: "7fa3e4336e07d19ff3c8e12af912cb74")
!473 = !{!474}
!474 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !475, templateParams: !485, identifier: "7fa3e4336e07d19ff3c8e12af912cb74_variant_part", discriminator: !304)
!475 = !{!476, !487}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !474, file: !7, baseType: !477, size: 1216, align: 64, extraData: i64 0)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !472, file: !7, size: 1216, align: 64, elements: !478, templateParams: !485, identifier: "7fa3e4336e07d19ff3c8e12af912cb74::Ok")
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !477, file: !7, baseType: !480, size: 1152, align: 64, offset: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transfer", scope: !56, file: !7, size: 1152, align: 64, elements: !481, templateParams: !16, identifier: "70a67154a20383ab2df16b87f751f50d")
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !480, file: !7, baseType: !59, size: 384, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !480, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !480, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!485 = !{!486, !160}
!486 = !DITemplateTypeParameter(name: "T", type: !480)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !474, file: !7, baseType: !488, size: 1216, align: 64, extraData: i64 1)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !472, file: !7, size: 1216, align: 64, elements: !489, templateParams: !485, identifier: "7fa3e4336e07d19ff3c8e12af912cb74::Err")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!491 = !{!492, !493}
!492 = !DILocalVariable(name: "residual", arg: 1, scope: !469, file: !41, line: 1913, type: !305)
!493 = !DILocalVariable(name: "e", scope: !494, file: !41, line: 1915, type: !161, align: 8)
!494 = distinct !DILexicalBlock(scope: !469, file: !41, line: 1915, column: 13)
!495 = !{!486, !160, !324}
!496 = !DILocation(line: 1913, column: 22, scope: !469)
!497 = !DILocation(line: 1915, column: 17, scope: !494)
!498 = !DILocation(line: 1915, column: 17, scope: !469)
!499 = !DILocation(line: 1915, column: 38, scope: !494)
!500 = !DILocation(line: 1915, column: 27, scope: !494)
!501 = !DILocation(line: 1915, column: 23, scope: !494)
!502 = !DILocation(line: 1917, column: 6, scope: !469)
!503 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::FreezeAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h9fb7a0a7870ba266E", scope: !42, file: !41, line: 1913, type: !504, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !529, retainedNodes: !525)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !305}
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::FreezeAccount, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !507, identifier: "bb99b546c74df455b63da146e25648d6")
!507 = !{!508}
!508 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !509, templateParams: !519, identifier: "bb99b546c74df455b63da146e25648d6_variant_part", discriminator: !304)
!509 = !{!510, !521}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !508, file: !7, baseType: !511, size: 1216, align: 64, extraData: i64 0)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !506, file: !7, size: 1216, align: 64, elements: !512, templateParams: !519, identifier: "bb99b546c74df455b63da146e25648d6::Ok")
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !511, file: !7, baseType: !514, size: 1152, align: 64, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "FreezeAccount", scope: !56, file: !7, size: 1152, align: 64, elements: !515, templateParams: !16, identifier: "ab41729e11ed5f1e7d6ff0786754a61b")
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !514, file: !7, baseType: !59, size: 384, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !514, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !514, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!519 = !{!520, !160}
!520 = !DITemplateTypeParameter(name: "T", type: !514)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !508, file: !7, baseType: !522, size: 1216, align: 64, extraData: i64 1)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !506, file: !7, size: 1216, align: 64, elements: !523, templateParams: !519, identifier: "bb99b546c74df455b63da146e25648d6::Err")
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !522, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!525 = !{!526, !527}
!526 = !DILocalVariable(name: "residual", arg: 1, scope: !503, file: !41, line: 1913, type: !305)
!527 = !DILocalVariable(name: "e", scope: !528, file: !41, line: 1915, type: !161, align: 8)
!528 = distinct !DILexicalBlock(scope: !503, file: !41, line: 1915, column: 13)
!529 = !{!520, !160, !324}
!530 = !DILocation(line: 1913, column: 22, scope: !503)
!531 = !DILocation(line: 1915, column: 17, scope: !528)
!532 = !DILocation(line: 1915, column: 17, scope: !503)
!533 = !DILocation(line: 1915, column: 38, scope: !528)
!534 = !DILocation(line: 1915, column: 27, scope: !528)
!535 = !DILocation(line: 1915, column: 23, scope: !528)
!536 = !DILocation(line: 1917, column: 6, scope: !503)
!537 = distinct !DISubprogram(name: "from_residual<anchor_spl::associated_token::Create, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17ha16b7673fbc06921E", scope: !42, file: !41, line: 1913, type: !538, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !568, retainedNodes: !564)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !305}
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::associated_token::Create, anchor_lang::error::Error>", scope: !43, file: !7, size: 2752, align: 64, elements: !541, identifier: "3ff2bbe704ae9a8c36b1233cf5f72d6c")
!541 = !{!542}
!542 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 2752, align: 64, elements: !543, templateParams: !558, identifier: "3ff2bbe704ae9a8c36b1233cf5f72d6c_variant_part", discriminator: !304)
!543 = !{!544, !560}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !542, file: !7, baseType: !545, size: 2752, align: 64, extraData: i64 0)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !540, file: !7, size: 2752, align: 64, elements: !546, templateParams: !558, identifier: "3ff2bbe704ae9a8c36b1233cf5f72d6c::Ok")
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !545, file: !7, baseType: !548, size: 2688, align: 64, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "Create", scope: !549, file: !7, size: 2688, align: 64, elements: !550, templateParams: !16, identifier: "ddd2c484a1994f4e6053c2e5c69491b9")
!549 = !DINamespace(name: "associated_token", scope: !4)
!550 = !{!551, !552, !553, !554, !555, !556, !557}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "payer", scope: !548, file: !7, baseType: !59, size: 384, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "associated_token", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "system_program", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 1536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "token_program", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 1920)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !548, file: !7, baseType: !59, size: 384, align: 64, offset: 2304)
!558 = !{!559, !160}
!559 = !DITemplateTypeParameter(name: "T", type: !548)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !542, file: !7, baseType: !561, size: 2752, align: 64, extraData: i64 1)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !540, file: !7, size: 2752, align: 64, elements: !562, templateParams: !558, identifier: "3ff2bbe704ae9a8c36b1233cf5f72d6c::Err")
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !561, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!564 = !{!565, !566}
!565 = !DILocalVariable(name: "residual", arg: 1, scope: !537, file: !41, line: 1913, type: !305)
!566 = !DILocalVariable(name: "e", scope: !567, file: !41, line: 1915, type: !161, align: 8)
!567 = distinct !DILexicalBlock(scope: !537, file: !41, line: 1915, column: 13)
!568 = !{!559, !160, !324}
!569 = !DILocation(line: 1913, column: 22, scope: !537)
!570 = !DILocation(line: 1915, column: 17, scope: !567)
!571 = !DILocation(line: 1915, column: 17, scope: !537)
!572 = !DILocation(line: 1915, column: 38, scope: !567)
!573 = !DILocation(line: 1915, column: 27, scope: !567)
!574 = !DILocation(line: 1915, column: 23, scope: !567)
!575 = !DILocation(line: 1917, column: 6, scope: !537)
!576 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::SetAuthority, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17ha3c27982fe08e894E", scope: !42, file: !41, line: 1913, type: !577, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !601, retainedNodes: !597)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !305}
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::SetAuthority, anchor_lang::error::Error>", scope: !43, file: !7, size: 960, align: 64, elements: !580, identifier: "ab63aab6f31a46721e6a909ae2702f9")
!580 = !{!581}
!581 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 960, align: 64, elements: !582, templateParams: !591, identifier: "ab63aab6f31a46721e6a909ae2702f9_variant_part", discriminator: !304)
!582 = !{!583, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !581, file: !7, baseType: !584, size: 960, align: 64, extraData: i64 0)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !579, file: !7, size: 960, align: 64, elements: !585, templateParams: !591, identifier: "ab63aab6f31a46721e6a909ae2702f9::Ok")
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !584, file: !7, baseType: !587, size: 768, align: 64, offset: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "SetAuthority", scope: !56, file: !7, size: 768, align: 64, elements: !588, templateParams: !16, identifier: "451bccab5ae06da651d1adf2185d14f")
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "current_authority", scope: !587, file: !7, baseType: !59, size: 384, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "account_or_mint", scope: !587, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!591 = !{!592, !160}
!592 = !DITemplateTypeParameter(name: "T", type: !587)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !581, file: !7, baseType: !594, size: 960, align: 64, extraData: i64 1)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !579, file: !7, size: 960, align: 64, elements: !595, templateParams: !591, identifier: "ab63aab6f31a46721e6a909ae2702f9::Err")
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !594, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!597 = !{!598, !599}
!598 = !DILocalVariable(name: "residual", arg: 1, scope: !576, file: !41, line: 1913, type: !305)
!599 = !DILocalVariable(name: "e", scope: !600, file: !41, line: 1915, type: !161, align: 8)
!600 = distinct !DILexicalBlock(scope: !576, file: !41, line: 1915, column: 13)
!601 = !{!592, !160, !324}
!602 = !DILocation(line: 1913, column: 22, scope: !576)
!603 = !DILocation(line: 1915, column: 17, scope: !600)
!604 = !DILocation(line: 1915, column: 17, scope: !576)
!605 = !DILocation(line: 1915, column: 38, scope: !600)
!606 = !DILocation(line: 1915, column: 27, scope: !600)
!607 = !DILocation(line: 1915, column: 23, scope: !600)
!608 = !DILocation(line: 1917, column: 6, scope: !576)
!609 = distinct !DISubprogram(name: "from_residual<solana_program::pubkey::Pubkey, solana_program::program_error::ProgramError, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hb71b4156051a00bcE", scope: !42, file: !41, line: 1913, type: !610, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !641, retainedNodes: !637)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !627}
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<solana_program::pubkey::Pubkey, anchor_lang::error::Error>", scope: !43, file: !7, size: 960, align: 64, elements: !613, identifier: "832e224455cecae28d8b1ba3ffd44a25")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 960, align: 64, elements: !615, templateParams: !620, identifier: "832e224455cecae28d8b1ba3ffd44a25_variant_part", discriminator: !626)
!615 = !{!616, !622}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !614, file: !7, baseType: !617, size: 960, align: 64, extraData: i64 0)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !612, file: !7, size: 960, align: 64, elements: !618, templateParams: !620, identifier: "832e224455cecae28d8b1ba3ffd44a25::Ok")
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !617, file: !7, baseType: !6, size: 256, align: 8, offset: 8)
!620 = !{!621, !160}
!621 = !DITemplateTypeParameter(name: "T", type: !6)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !614, file: !7, baseType: !623, size: 960, align: 64, extraData: i64 1)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !612, file: !7, size: 960, align: 64, elements: !624, templateParams: !620, identifier: "832e224455cecae28d8b1ba3ffd44a25::Err")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !623, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, solana_program::program_error::ProgramError>", scope: !43, file: !7, size: 256, align: 64, elements: !628, identifier: "1eb2146ad37aa6c38733cf03aa229953")
!628 = !{!629}
!629 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 256, align: 64, elements: !630, templateParams: !635, identifier: "1eb2146ad37aa6c38733cf03aa229953_variant_part")
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !629, file: !7, baseType: !632, size: 256, align: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !627, file: !7, size: 256, align: 64, elements: !633, templateParams: !635, identifier: "1eb2146ad37aa6c38733cf03aa229953::Err")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !632, file: !7, baseType: !247, size: 256, align: 64)
!635 = !{!314, !636}
!636 = !DITemplateTypeParameter(name: "E", type: !247)
!637 = !{!638, !639}
!638 = !DILocalVariable(name: "residual", arg: 1, scope: !609, file: !41, line: 1913, type: !627)
!639 = !DILocalVariable(name: "e", scope: !640, file: !41, line: 1915, type: !247, align: 8)
!640 = distinct !DILexicalBlock(scope: !609, file: !41, line: 1915, column: 13)
!641 = !{!621, !636, !324}
!642 = !DILocation(line: 1913, column: 22, scope: !609)
!643 = !DILocation(line: 1915, column: 17, scope: !640)
!644 = !DILocation(line: 1915, column: 17, scope: !609)
!645 = !DILocation(line: 1915, column: 38, scope: !640)
!646 = !DILocation(line: 1915, column: 27, scope: !640)
!647 = !DILocation(line: 1915, column: 23, scope: !640)
!648 = !DILocation(line: 1917, column: 6, scope: !609)
!649 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Approve, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hda45a330c1856932E", scope: !42, file: !41, line: 1913, type: !650, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !675, retainedNodes: !671)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !305}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Approve, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !653, identifier: "b9a35954e193aa48ec98f23666d33dcb")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !655, templateParams: !665, identifier: "b9a35954e193aa48ec98f23666d33dcb_variant_part", discriminator: !304)
!655 = !{!656, !667}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !654, file: !7, baseType: !657, size: 1216, align: 64, extraData: i64 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !652, file: !7, size: 1216, align: 64, elements: !658, templateParams: !665, identifier: "b9a35954e193aa48ec98f23666d33dcb::Ok")
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !657, file: !7, baseType: !660, size: 1152, align: 64, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "Approve", scope: !56, file: !7, size: 1152, align: 64, elements: !661, templateParams: !16, identifier: "314b881fbc8e6b3d4303872365265ea")
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !660, file: !7, baseType: !59, size: 384, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "delegate", scope: !660, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !660, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!665 = !{!666, !160}
!666 = !DITemplateTypeParameter(name: "T", type: !660)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !654, file: !7, baseType: !668, size: 1216, align: 64, extraData: i64 1)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !652, file: !7, size: 1216, align: 64, elements: !669, templateParams: !665, identifier: "b9a35954e193aa48ec98f23666d33dcb::Err")
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !668, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!671 = !{!672, !673}
!672 = !DILocalVariable(name: "residual", arg: 1, scope: !649, file: !41, line: 1913, type: !305)
!673 = !DILocalVariable(name: "e", scope: !674, file: !41, line: 1915, type: !161, align: 8)
!674 = distinct !DILexicalBlock(scope: !649, file: !41, line: 1915, column: 13)
!675 = !{!666, !160, !324}
!676 = !DILocation(line: 1913, column: 22, scope: !649)
!677 = !DILocation(line: 1915, column: 17, scope: !674)
!678 = !DILocation(line: 1915, column: 17, scope: !649)
!679 = !DILocation(line: 1915, column: 38, scope: !674)
!680 = !DILocation(line: 1915, column: 27, scope: !674)
!681 = !DILocation(line: 1915, column: 23, scope: !674)
!682 = !DILocation(line: 1917, column: 6, scope: !649)
!683 = distinct !DISubprogram(name: "from_residual<u64, solana_program::program_error::ProgramError, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17he793323dc67f2408E", scope: !42, file: !41, line: 1913, type: !684, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !704, retainedNodes: !700)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !627}
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, anchor_lang::error::Error>", scope: !43, file: !7, size: 960, align: 64, elements: !687, identifier: "f1e3b863e7ee9215136e22654e580a43")
!687 = !{!688}
!688 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 960, align: 64, elements: !689, templateParams: !694, identifier: "f1e3b863e7ee9215136e22654e580a43_variant_part", discriminator: !304)
!689 = !{!690, !696}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !688, file: !7, baseType: !691, size: 960, align: 64, extraData: i64 0)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !686, file: !7, size: 960, align: 64, elements: !692, templateParams: !694, identifier: "f1e3b863e7ee9215136e22654e580a43::Ok")
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !691, file: !7, baseType: !111, size: 64, align: 64, offset: 64)
!694 = !{!695, !160}
!695 = !DITemplateTypeParameter(name: "T", type: !111)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !688, file: !7, baseType: !697, size: 960, align: 64, extraData: i64 1)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !686, file: !7, size: 960, align: 64, elements: !698, templateParams: !694, identifier: "f1e3b863e7ee9215136e22654e580a43::Err")
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !697, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!700 = !{!701, !702}
!701 = !DILocalVariable(name: "residual", arg: 1, scope: !683, file: !41, line: 1913, type: !627)
!702 = !DILocalVariable(name: "e", scope: !703, file: !41, line: 1915, type: !247, align: 8)
!703 = distinct !DILexicalBlock(scope: !683, file: !41, line: 1915, column: 13)
!704 = !{!695, !636, !324}
!705 = !DILocation(line: 1913, column: 22, scope: !683)
!706 = !DILocation(line: 1915, column: 17, scope: !703)
!707 = !DILocation(line: 1915, column: 17, scope: !683)
!708 = !DILocation(line: 1915, column: 38, scope: !703)
!709 = !DILocation(line: 1915, column: 27, scope: !703)
!710 = !DILocation(line: 1915, column: 23, scope: !703)
!711 = !DILocation(line: 1917, column: 6, scope: !683)
!712 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::MintTo, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17he7a3443cd75b5b24E", scope: !42, file: !41, line: 1913, type: !713, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !738, retainedNodes: !734)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !305}
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::MintTo, anchor_lang::error::Error>", scope: !43, file: !7, size: 1216, align: 64, elements: !716, identifier: "29fd2ddfb3afc0705f151bc58989cb0c")
!716 = !{!717}
!717 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !7, size: 1216, align: 64, elements: !718, templateParams: !728, identifier: "29fd2ddfb3afc0705f151bc58989cb0c_variant_part", discriminator: !304)
!718 = !{!719, !730}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !717, file: !7, baseType: !720, size: 1216, align: 64, extraData: i64 0)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !715, file: !7, size: 1216, align: 64, elements: !721, templateParams: !728, identifier: "29fd2ddfb3afc0705f151bc58989cb0c::Ok")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !720, file: !7, baseType: !723, size: 1152, align: 64, offset: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "MintTo", scope: !56, file: !7, size: 1152, align: 64, elements: !724, templateParams: !16, identifier: "f22cedb3a6648932f59ff6c0575820de")
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !723, file: !7, baseType: !59, size: 384, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !723, file: !7, baseType: !59, size: 384, align: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !723, file: !7, baseType: !59, size: 384, align: 64, offset: 768)
!728 = !{!729, !160}
!729 = !DITemplateTypeParameter(name: "T", type: !723)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !717, file: !7, baseType: !731, size: 1216, align: 64, extraData: i64 1)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !715, file: !7, size: 1216, align: 64, elements: !732, templateParams: !728, identifier: "29fd2ddfb3afc0705f151bc58989cb0c::Err")
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !731, file: !7, baseType: !161, size: 896, align: 64, offset: 64)
!734 = !{!735, !736}
!735 = !DILocalVariable(name: "residual", arg: 1, scope: !712, file: !41, line: 1913, type: !305)
!736 = !DILocalVariable(name: "e", scope: !737, file: !41, line: 1915, type: !161, align: 8)
!737 = distinct !DILexicalBlock(scope: !712, file: !41, line: 1915, column: 13)
!738 = !{!729, !160, !324}
!739 = !DILocation(line: 1913, column: 22, scope: !712)
!740 = !DILocation(line: 1915, column: 17, scope: !737)
!741 = !DILocation(line: 1915, column: 17, scope: !712)
!742 = !DILocation(line: 1915, column: 38, scope: !737)
!743 = !DILocation(line: 1915, column: 27, scope: !737)
!744 = !DILocation(line: 1915, column: 23, scope: !737)
!745 = !DILocation(line: 1917, column: 6, scope: !712)
!746 = distinct !DISubprogram(name: "from_le_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$13from_le_bytes17h559083492c1896a4E", scope: !748, file: !747, line: 2188, type: !750, scopeLine: 2188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !16, retainedNodes: !755)
!747 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bd5648afa999a95525abfd2832ef4ce")
!748 = !DINamespace(name: "{impl#9}", scope: !749)
!749 = !DINamespace(name: "num", scope: !44)
!750 = !DISubroutineType(types: !751)
!751 = !{!111, !752}
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, align: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 8, lowerBound: 0)
!755 = !{!756}
!756 = !DILocalVariable(name: "bytes", arg: 1, scope: !746, file: !747, line: 2188, type: !752)
!757 = !DILocation(line: 2188, column: 36, scope: !746)
!758 = !DILocation(line: 2189, column: 47, scope: !746)
!759 = !DILocation(line: 2189, column: 27, scope: !746)
!760 = !DILocalVariable(name: "x", arg: 1, scope: !761, file: !747, line: 321, type: !111)
!761 = distinct !DISubprogram(name: "from_le", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$7from_le17h910b1f5407a64513E", scope: !748, file: !747, line: 321, type: !762, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !16, retainedNodes: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{!111, !111}
!764 = !{!760}
!765 = !DILocation(line: 321, column: 30, scope: !761, inlinedAt: !766)
!766 = distinct !DILocation(line: 2189, column: 13, scope: !746)
!767 = !DILocation(line: 2189, column: 13, scope: !746)
!768 = !DILocation(line: 2190, column: 10, scope: !746)
!769 = distinct !DISubprogram(name: "from_ne_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$13from_ne_bytes17hef4f32df3c5ca574E", scope: !748, file: !747, line: 2232, type: !750, scopeLine: 2232, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !16, retainedNodes: !770)
!770 = !{!771}
!771 = !DILocalVariable(name: "bytes", arg: 1, scope: !769, file: !747, line: 2232, type: !752)
!772 = !DILocation(line: 2232, column: 36, scope: !769)
!773 = !DILocation(line: 2234, column: 37, scope: !769)
!774 = !DILocation(line: 2234, column: 22, scope: !769)
!775 = !DILocation(line: 2235, column: 10, scope: !769)
!776 = distinct !DISubprogram(name: "call_once<fn(spl_token::state::Account) -> anchor_spl::token::TokenAccount, (spl_token::state::Account)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h15a7b3c9a61fc059E", scope: !778, file: !777, line: 227, type: !781, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !829, retainedNodes: !823)
!777 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a40c014f8a7b8b7cd612b461a47e902")
!778 = !DINamespace(name: "FnOnce", scope: !779)
!779 = !DINamespace(name: "function", scope: !780)
!780 = !DINamespace(name: "ops", scope: !44)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !820, !786}
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenAccount", scope: !56, file: !7, size: 1408, align: 64, elements: !784, templateParams: !16, identifier: "4ae0a2cb827005149d62a1db0b6c6063")
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !783, file: !7, baseType: !786, size: 1408, align: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "Account", scope: !26, file: !7, size: 1408, align: 64, elements: !787, templateParams: !16, identifier: "b4d251b99d05429f816d45fd60d333c")
!787 = !{!788, !789, !790, !791, !805, !806, !818, !819}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !786, file: !7, baseType: !6, size: 256, align: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !786, file: !7, baseType: !6, size: 256, align: 8, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "amount", scope: !786, file: !7, baseType: !111, size: 64, align: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "delegate", scope: !786, file: !7, baseType: !792, size: 288, align: 32, offset: 576)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "COption<solana_program::pubkey::Pubkey>", scope: !793, file: !7, size: 288, align: 32, elements: !794, identifier: "24f6c42b3a792afaacbf420ec2392360")
!793 = !DINamespace(name: "program_option", scope: !9)
!794 = !{!795}
!795 = !DICompositeType(tag: DW_TAG_variant_part, scope: !793, file: !7, size: 288, align: 32, elements: !796, templateParams: !799, identifier: "24f6c42b3a792afaacbf420ec2392360_variant_part", discriminator: !804)
!796 = !{!797, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !795, file: !7, baseType: !798, size: 288, align: 32, extraData: i64 0)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !792, file: !7, size: 288, align: 32, elements: !16, templateParams: !799, identifier: "24f6c42b3a792afaacbf420ec2392360::None")
!799 = !{!621}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !795, file: !7, baseType: !801, size: 288, align: 32, extraData: i64 1)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !792, file: !7, size: 288, align: 32, elements: !802, templateParams: !799, identifier: "24f6c42b3a792afaacbf420ec2392360::Some")
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !801, file: !7, baseType: !6, size: 256, align: 8, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, scope: !793, file: !7, baseType: !202, size: 32, align: 32, flags: DIFlagArtificial)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !786, file: !7, baseType: !25, size: 8, align: 8, offset: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "is_native", scope: !786, file: !7, baseType: !807, size: 128, align: 64, offset: 896)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "COption<u64>", scope: !793, file: !7, size: 128, align: 64, elements: !808, identifier: "e96447e2978dc74d1539907e9d21fb9f")
!808 = !{!809}
!809 = !DICompositeType(tag: DW_TAG_variant_part, scope: !793, file: !7, size: 128, align: 64, elements: !810, templateParams: !813, identifier: "e96447e2978dc74d1539907e9d21fb9f_variant_part", discriminator: !804)
!810 = !{!811, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !809, file: !7, baseType: !812, size: 128, align: 64, extraData: i64 0)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !807, file: !7, size: 128, align: 64, elements: !16, templateParams: !813, identifier: "e96447e2978dc74d1539907e9d21fb9f::None")
!813 = !{!695}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !809, file: !7, baseType: !815, size: 128, align: 64, extraData: i64 1)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !807, file: !7, size: 128, align: 64, elements: !816, templateParams: !813, identifier: "e96447e2978dc74d1539907e9d21fb9f::Some")
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !815, file: !7, baseType: !111, size: 64, align: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "delegated_amount", scope: !786, file: !7, baseType: !111, size: 64, align: 64, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "close_authority", scope: !786, file: !7, baseType: !792, size: 288, align: 32, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(spl_token::state::Account) -> anchor_spl::token::TokenAccount", baseType: !821, align: 8, dwarfAddressSpace: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!783, !786}
!823 = !{!824, !825}
!824 = !DILocalVariable(arg: 1, scope: !776, file: !777, line: 227, type: !820)
!825 = !DILocalVariable(arg: 2, scope: !776, file: !777, line: 227, type: !826)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "(spl_token::state::Account)", file: !7, size: 1408, align: 64, elements: !827, templateParams: !16, identifier: "ede5354bc7ab361ddd31b4861c5427ed")
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !826, file: !7, baseType: !786, size: 1408, align: 64)
!829 = !{!830, !831}
!830 = !DITemplateTypeParameter(name: "Self", type: !820)
!831 = !DITemplateTypeParameter(name: "Args", type: !826)
!832 = !DILocation(line: 227, column: 5, scope: !776)
!833 = distinct !DISubprogram(name: "call_once<fn(solana_program::program_error::ProgramError) -> anchor_lang::error::Error, (solana_program::program_error::ProgramError)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h431c2d96cdd326f2E", scope: !778, file: !777, line: 227, type: !834, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !845, retainedNodes: !839)
!834 = !DISubroutineType(types: !835)
!835 = !{!161, !836, !247}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(solana_program::program_error::ProgramError) -> anchor_lang::error::Error", baseType: !837, align: 8, dwarfAddressSpace: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!161, !247}
!839 = !{!840, !841}
!840 = !DILocalVariable(arg: 1, scope: !833, file: !777, line: 227, type: !836)
!841 = !DILocalVariable(arg: 2, scope: !833, file: !777, line: 227, type: !842)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "(solana_program::program_error::ProgramError)", file: !7, size: 256, align: 64, elements: !843, templateParams: !16, identifier: "470901f6a1bcaceb772af62f4c78ef58")
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !842, file: !7, baseType: !247, size: 256, align: 64)
!845 = !{!846, !847}
!846 = !DITemplateTypeParameter(name: "Self", type: !836)
!847 = !DITemplateTypeParameter(name: "Args", type: !842)
!848 = !DILocation(line: 227, column: 5, scope: !833)
!849 = distinct !DISubprogram(name: "call_once<fn(spl_token::state::Mint) -> anchor_spl::token::Mint, (spl_token::state::Mint)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h480cdf64702e7129E", scope: !778, file: !777, line: 227, type: !850, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !871, retainedNodes: !865)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !862, !855}
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mint", scope: !56, file: !7, size: 704, align: 64, elements: !853, templateParams: !16, identifier: "410dc8aa45baeae11ef0543a24d7f28b")
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !852, file: !7, baseType: !855, size: 704, align: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mint", scope: !26, file: !7, size: 704, align: 64, elements: !856, templateParams: !16, identifier: "9ad6af1ec5b30521f09807f74b93bcb9")
!856 = !{!857, !858, !859, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mint_authority", scope: !855, file: !7, baseType: !792, size: 288, align: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "supply", scope: !855, file: !7, baseType: !111, size: 64, align: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decimals", scope: !855, file: !7, baseType: !13, size: 8, align: 8, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !855, file: !7, baseType: !65, size: 8, align: 8, offset: 392)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_authority", scope: !855, file: !7, baseType: !792, size: 288, align: 32, offset: 416)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(spl_token::state::Mint) -> anchor_spl::token::Mint", baseType: !863, align: 8, dwarfAddressSpace: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!852, !855}
!865 = !{!866, !867}
!866 = !DILocalVariable(arg: 1, scope: !849, file: !777, line: 227, type: !862)
!867 = !DILocalVariable(arg: 2, scope: !849, file: !777, line: 227, type: !868)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "(spl_token::state::Mint)", file: !7, size: 704, align: 64, elements: !869, templateParams: !16, identifier: "cc9d033b089ac203874308f6c0a4")
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !868, file: !7, baseType: !855, size: 704, align: 64)
!871 = !{!872, !873}
!872 = !DITemplateTypeParameter(name: "Self", type: !862)
!873 = !DITemplateTypeParameter(name: "Args", type: !868)
!874 = !DILocation(line: 227, column: 5, scope: !849)
!875 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::Burn>", linkageName: "_ZN4core3ptr44drop_in_place$LT$anchor_spl..token..Burn$GT$17he7dbe8793372a032E", scope: !75, file: !876, line: 188, type: !877, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !882, retainedNodes: !880)
!876 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "207736266ff0d04d675044b37a0a2de6")
!877 = !DISubroutineType(types: !878)
!878 = !{null, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut Burn", baseType: !446, size: 64, align: 64, dwarfAddressSpace: 0)
!880 = !{!881}
!881 = !DILocalVariable(arg: 1, scope: !875, file: !876, line: 188, type: !879)
!882 = !{!452}
!883 = !DILocation(line: 188, column: 1, scope: !875)
!884 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::MintTo>", linkageName: "_ZN4core3ptr46drop_in_place$LT$anchor_spl..token..MintTo$GT$17h3abd7b07f7098473E", scope: !75, file: !876, line: 188, type: !885, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !890, retainedNodes: !888)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut MintTo", baseType: !723, size: 64, align: 64, dwarfAddressSpace: 0)
!888 = !{!889}
!889 = !DILocalVariable(arg: 1, scope: !884, file: !876, line: 188, type: !887)
!890 = !{!729}
!891 = !DILocation(line: 188, column: 1, scope: !884)
!892 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::Approve>", linkageName: "_ZN4core3ptr47drop_in_place$LT$anchor_spl..token..Approve$GT$17hdc864dfa60c6813cE", scope: !75, file: !876, line: 188, type: !893, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !898, retainedNodes: !896)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut Approve", baseType: !660, size: 64, align: 64, dwarfAddressSpace: 0)
!896 = !{!897}
!897 = !DILocalVariable(arg: 1, scope: !892, file: !876, line: 188, type: !895)
!898 = !{!666}
!899 = !DILocation(line: 188, column: 1, scope: !892)
!900 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::Transfer>", linkageName: "_ZN4core3ptr48drop_in_place$LT$anchor_spl..token..Transfer$GT$17h37fe83328cfb6becE", scope: !75, file: !876, line: 188, type: !901, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !906, retainedNodes: !904)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut Transfer", baseType: !480, size: 64, align: 64, dwarfAddressSpace: 0)
!904 = !{!905}
!905 = !DILocalVariable(arg: 1, scope: !900, file: !876, line: 188, type: !903)
!906 = !{!486}
!907 = !DILocation(line: 188, column: 1, scope: !900)
!908 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::ThawAccount>", linkageName: "_ZN4core3ptr51drop_in_place$LT$anchor_spl..token..ThawAccount$GT$17ha20537808751e995E", scope: !75, file: !876, line: 188, type: !909, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !914, retainedNodes: !912)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ThawAccount", baseType: !343, size: 64, align: 64, dwarfAddressSpace: 0)
!912 = !{!913}
!913 = !DILocalVariable(arg: 1, scope: !908, file: !876, line: 188, type: !911)
!914 = !{!349}
!915 = !DILocation(line: 188, column: 1, scope: !908)
!916 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::CloseAccount>", linkageName: "_ZN4core3ptr52drop_in_place$LT$anchor_spl..token..CloseAccount$GT$17h4064e411d798ab2dE", scope: !75, file: !876, line: 188, type: !917, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !922, retainedNodes: !920)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut CloseAccount", baseType: !412, size: 64, align: 64, dwarfAddressSpace: 0)
!920 = !{!921}
!921 = !DILocalVariable(arg: 1, scope: !916, file: !876, line: 188, type: !919)
!922 = !{!418}
!923 = !DILocation(line: 188, column: 1, scope: !916)
!924 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::SetAuthority>", linkageName: "_ZN4core3ptr52drop_in_place$LT$anchor_spl..token..SetAuthority$GT$17h4c6f836b38e9f604E", scope: !75, file: !876, line: 188, type: !925, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !930, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut SetAuthority", baseType: !587, size: 64, align: 64, dwarfAddressSpace: 0)
!928 = !{!929}
!929 = !DILocalVariable(arg: 1, scope: !924, file: !876, line: 188, type: !927)
!930 = !{!592}
!931 = !DILocation(line: 188, column: 1, scope: !924)
!932 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::FreezeAccount>", linkageName: "_ZN4core3ptr53drop_in_place$LT$anchor_spl..token..FreezeAccount$GT$17h3513f41bc8848e4eE", scope: !75, file: !876, line: 188, type: !933, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !938, retainedNodes: !936)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut FreezeAccount", baseType: !514, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !{!937}
!937 = !DILocalVariable(arg: 1, scope: !932, file: !876, line: 188, type: !935)
!938 = !{!520}
!939 = !DILocation(line: 188, column: 1, scope: !932)
!940 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::InitializeMint>", linkageName: "_ZN4core3ptr54drop_in_place$LT$anchor_spl..token..InitializeMint$GT$17h4880e1dc04ef47a3E", scope: !75, file: !876, line: 188, type: !941, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !946, retainedNodes: !944)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut InitializeMint", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!944 = !{!945}
!945 = !DILocalVariable(arg: 1, scope: !940, file: !876, line: 188, type: !943)
!946 = !{!159}
!947 = !DILocation(line: 188, column: 1, scope: !940)
!948 = distinct !DISubprogram(name: "drop_in_place<anchor_spl::token::InitializeAccount>", linkageName: "_ZN4core3ptr57drop_in_place$LT$anchor_spl..token..InitializeAccount$GT$17h38afd97c3c81b012E", scope: !75, file: !876, line: 188, type: !949, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !954, retainedNodes: !952)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !951}
