; ModuleID = 'digest.df189a42-cgu.0'
source_filename = "digest.df189a42-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"mac::MacError" = type {}
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%InvalidOutputSize = type {}
%InvalidBufferSize = type {}
%"core::fmt::DebugTuple" = type { %"core::fmt::Formatter"*, i64, i8, i8, [6 x i8] }

@alloc115 = private unnamed_addr constant <{ [16 x i8] }> <{ [16 x i8] c"MAC tag mismatch" }>, align 1
@alloc116 = private unnamed_addr constant <{ [19 x i8] }> <{ [19 x i8] c"invalid output size" }>, align 1
@alloc117 = private unnamed_addr constant <{ [21 x i8] }> <{ [21 x i8] c"invalid buffer length" }>, align 1
@alloc118 = private unnamed_addr constant <{ [5 x i8] }> <{ [5 x i8] c"Right" }>, align 1
@alloc119 = private unnamed_addr constant <{ [4 x i8] }> <{ [4 x i8] c"Left" }>, align 1
@alloc120 = private unnamed_addr constant <{ [8 x i8] }> <{ [8 x i8] c"MacError" }>, align 1
@alloc121 = private unnamed_addr constant <{ [17 x i8] }> <{ [17 x i8] c"InvalidOutputSize" }>, align 1
@alloc122 = private unnamed_addr constant <{ [17 x i8] }> <{ [17 x i8] c"InvalidBufferSize" }>, align 1

; digest::digest::<impl core::clone::Clone for alloc::boxed::Box<dyn digest::digest::DynDigest>>::clone
; Function Attrs: nounwind

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !3, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!3 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3")
!4 = !{!5, !13, !22}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !7, file: !6, baseType: !9, size: 8, align: 8, flags: DIFlagEnumClass, elements: !10)
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "result", scope: !8)
!8 = !DINamespace(name: "core", scope: null)
!9 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "Ok", value: 0)
!12 = !DIEnumerator(name: "Err", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !14, file: !6, baseType: !9, size: 8, align: 8, flags: DIFlagEnumClass, elements: !17)
!14 = !DINamespace(name: "v1", scope: !15)
!15 = !DINamespace(name: "rt", scope: !16)
!16 = !DINamespace(name: "fmt", scope: !8)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "Left", value: 0)
!19 = !DIEnumerator(name: "Right", value: 1)
!20 = !DIEnumerator(name: "Center", value: 2)
!21 = !DIEnumerator(name: "Unknown", value: 3)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TruncSide", scope: !23, file: !6, baseType: !9, size: 8, align: 8, flags: DIFlagEnumClass, elements: !25)
!23 = !DINamespace(name: "core_api", scope: !24)
!24 = !DINamespace(name: "digest", scope: null)
!25 = !{!18, !19}
!26 = distinct !DISubprogram(name: "clone", linkageName: "_ZN6digest6digest107_$LT$impl$u20$core..clone..Clone$u20$for$u20$alloc..boxed..Box$LT$dyn$u20$digest..digest..DynDigest$GT$$GT$5clone17hc2c342176b5c0fcaE", scope: !28, file: !27, line: 233, type: !30, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !55)
!27 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3/src/digest.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3", checksumkind: CSK_MD5, checksum: "380c698641c1fceb7adb03f9187caab1")
!28 = !DINamespace(name: "{impl#2}", scope: !29)
!29 = !DINamespace(name: "digest", scope: !24)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !54}
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<dyn digest::digest::DynDigest, alloc::alloc::Global>", scope: !33, file: !6, size: 128, align: 64, elements: !35, templateParams: !44, identifier: "f316feffa1a077e5a8e084f3f01c09c6")
!33 = !DINamespace(name: "boxed", scope: !34)
!34 = !DINamespace(name: "alloc", scope: null)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !32, file: !6, baseType: !37, size: 64, align: 64, flags: DIFlagArtificial)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !32, file: !6, baseType: !39, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 64, elements: !42)
!41 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!42 = !{!43}
!43 = !DISubrange(count: 3, lowerBound: 0)
!44 = !{!45, !51}
!45 = !DITemplateTypeParameter(name: "T", type: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn digest::digest::DynDigest", file: !6, align: 8, elements: !47, templateParams: !50, identifier: "5e5096a34f23ed3ec9d65243f0984f9f")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !46, file: !6, baseType: !37, size: 64, align: 64, flags: DIFlagArtificial)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !46, file: !6, baseType: !39, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!50 = !{}
!51 = !DITemplateTypeParameter(name: "A", type: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !53, file: !6, align: 8, elements: !50, templateParams: !50, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!53 = !DINamespace(name: "alloc", scope: !34)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Box<dyn digest::digest::DynDigest, alloc::alloc::Global>", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !{!56}
!56 = !DILocalVariable(name: "self", arg: 1, scope: !26, file: !27, line: 233, type: !54)
!57 = !DILocation(line: 233, column: 14, scope: !26)
!58 = !DILocation(line: 234, column: 9, scope: !26)
!59 = !DILocation(line: 235, column: 6, scope: !26)
!60 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN60_$LT$digest..mac..MacError$u20$as$u20$core..fmt..Display$GT$3fmt17hebffc26e451de143E", scope: !62, file: !61, line: 255, type: !64, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !98)
!61 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3/src/mac.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3", checksumkind: CSK_MD5, checksum: "723fabf4267ab021b4f3eb0e9cd9bc96")
!62 = !DINamespace(name: "{impl#7}", scope: !63)
!63 = !DINamespace(name: "mac", scope: !24)
!64 = !DISubroutineType(types: !65)
!65 = !{!5, !66, !68}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&MacError", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "MacError", scope: !63, file: !6, align: 8, elements: !50, templateParams: !50, identifier: "a063f8c2768d47a8d48c2a7c5558d470")
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !16, file: !6, size: 512, align: 64, elements: !70, templateParams: !50, identifier: "37f4daa474efe0abec93026f6af11d04")
!70 = !{!71, !73, !75, !76, !92, !93}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !6, baseType: !72, size: 32, align: 32, offset: 384)
!72 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !69, file: !6, baseType: !74, size: 32, align: 32, offset: 416)
!74 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !69, file: !6, baseType: !13, size: 8, align: 8, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !69, file: !6, baseType: !77, size: 128, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !78, file: !6, size: 128, align: 64, elements: !79, identifier: "4849786e80860f5416c4c6b259f5a683")
!78 = !DINamespace(name: "option", scope: !8)
!79 = !{!80}
!80 = !DICompositeType(tag: DW_TAG_variant_part, scope: !78, file: !6, size: 128, align: 64, elements: !81, templateParams: !84, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !90)
!81 = !{!82, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !80, file: !6, baseType: !83, size: 128, align: 64, extraData: i64 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !77, file: !6, size: 128, align: 64, elements: !50, templateParams: !84, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!84 = !{!85}
!85 = !DITemplateTypeParameter(name: "T", type: !41)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !80, file: !6, baseType: !87, size: 128, align: 64, extraData: i64 1)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !77, file: !6, size: 128, align: 64, elements: !88, templateParams: !84, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !87, file: !6, baseType: !41, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, baseType: !91, size: 64, align: 64, flags: DIFlagArtificial)
!91 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !69, file: !6, baseType: !77, size: 128, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !69, file: !6, baseType: !94, size: 128, align: 64, offset: 256)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !95, templateParams: !50, identifier: "ab0a0458a7bfc4114bcaaa179b3e8910")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !94, file: !6, baseType: !37, size: 64, align: 64, flags: DIFlagArtificial)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !94, file: !6, baseType: !39, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!98 = !{!99, !100}
!99 = !DILocalVariable(name: "self", arg: 1, scope: !60, file: !61, line: 255, type: !66)
!100 = !DILocalVariable(name: "f", arg: 2, scope: !60, file: !61, line: 255, type: !68)
!101 = !DILocation(line: 255, column: 12, scope: !60)
!102 = !DILocation(line: 255, column: 19, scope: !60)
!103 = !DILocation(line: 256, column: 9, scope: !60)
!104 = !DILocation(line: 257, column: 6, scope: !60)
!105 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN64_$LT$digest..InvalidOutputSize$u20$as$u20$core..fmt..Display$GT$3fmt17hdffc34556b001d63E", scope: !107, file: !106, line: 279, type: !108, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !112)
!106 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3", checksumkind: CSK_MD5, checksum: "e8a9302c43017bab9d8d1df9f8aeeb13")
!107 = !DINamespace(name: "{impl#0}", scope: !24)
!108 = !DISubroutineType(types: !109)
!109 = !{!5, !110, !68}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&InvalidOutputSize", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidOutputSize", scope: !24, file: !6, align: 8, elements: !50, templateParams: !50, identifier: "2493d60870586e3baeecd562e55102ed")
!112 = !{!113, !114}
!113 = !DILocalVariable(name: "self", arg: 1, scope: !105, file: !106, line: 279, type: !110)
!114 = !DILocalVariable(name: "f", arg: 2, scope: !105, file: !106, line: 279, type: !68)
!115 = !DILocation(line: 279, column: 12, scope: !105)
!116 = !DILocation(line: 279, column: 19, scope: !105)
!117 = !DILocation(line: 280, column: 9, scope: !105)
!118 = !DILocation(line: 281, column: 6, scope: !105)
!119 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN64_$LT$digest..InvalidBufferSize$u20$as$u20$core..fmt..Display$GT$3fmt17hc90605398ff49b4eE", scope: !120, file: !106, line: 293, type: !121, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !125)
!120 = !DINamespace(name: "{impl#2}", scope: !24)
!121 = !DISubroutineType(types: !122)
!122 = !{!5, !123, !68}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&InvalidBufferSize", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidBufferSize", scope: !24, file: !6, align: 8, elements: !50, templateParams: !50, identifier: "f2573ce936ab30727af0d3635479b49")
!125 = !{!126, !127}
!126 = !DILocalVariable(name: "self", arg: 1, scope: !119, file: !106, line: 293, type: !123)
!127 = !DILocalVariable(name: "f", arg: 2, scope: !119, file: !106, line: 293, type: !68)
!128 = !DILocation(line: 293, column: 12, scope: !119)
!129 = !DILocation(line: 293, column: 19, scope: !119)
!130 = !DILocation(line: 294, column: 9, scope: !119)
!131 = !DILocation(line: 295, column: 6, scope: !119)
!132 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN64_$LT$digest..core_api..TruncSide$u20$as$u20$core..fmt..Debug$GT$3fmt17h4b85fcb051bf1ecdE", scope: !134, file: !133, line: 113, type: !135, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !138)
!133 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3/src/core_api.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/digest-0.10.3", checksumkind: CSK_MD5, checksum: "f21ceae769a2f30151de388b190d44b9")
!134 = !DINamespace(name: "{impl#2}", scope: !23)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !137, !68}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&TruncSide", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !{!139, !140, !141, !152}
!139 = !DILocalVariable(name: "self", arg: 1, scope: !132, file: !133, line: 113, type: !137)
!140 = !DILocalVariable(name: "f", arg: 2, scope: !132, file: !133, line: 113, type: !68)
!141 = !DILocalVariable(name: "debug_trait_builder", scope: !142, file: !133, line: 113, type: !143, align: 8)
!142 = distinct !DILexicalBlock(scope: !132, file: !133, line: 113, column: 23)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut DebugTuple", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugTuple", scope: !145, file: !6, size: 192, align: 64, elements: !146, templateParams: !50, identifier: "b87e16a2b5c8e5fbfa596aeab6e7643")
!145 = !DINamespace(name: "builders", scope: !16)
!146 = !{!147, !148, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !144, file: !6, baseType: !68, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !144, file: !6, baseType: !5, size: 8, align: 8, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !144, file: !6, baseType: !41, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "empty_name", scope: !144, file: !6, baseType: !151, size: 8, align: 8, offset: 136)
!151 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DILocalVariable(name: "debug_trait_builder", scope: !153, file: !133, line: 113, type: !143, align: 8)
!153 = distinct !DILexicalBlock(scope: !132, file: !133, line: 113, column: 23)
!154 = !DILocation(line: 113, column: 23, scope: !132)
!155 = !{i8 0, i8 2}
!156 = !DILocation(line: 113, column: 23, scope: !153)
!157 = !DILocation(line: 113, column: 28, scope: !132)
!158 = !DILocation(line: 113, column: 23, scope: !142)
!159 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN58_$LT$digest..mac..MacError$u20$as$u20$core..fmt..Debug$GT$3fmt17h1024350eaa4c5b78E", scope: !160, file: !61, line: 250, type: !64, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !161)
!160 = !DINamespace(name: "{impl#11}", scope: !63)
!161 = !{!162, !163, !164}
!162 = !DILocalVariable(name: "self", arg: 1, scope: !159, file: !61, line: 250, type: !66)
!163 = !DILocalVariable(name: "f", arg: 2, scope: !159, file: !61, line: 250, type: !68)
!164 = !DILocalVariable(name: "debug_trait_builder", scope: !165, file: !61, line: 250, type: !143, align: 8)
!165 = distinct !DILexicalBlock(scope: !159, file: !61, line: 250, column: 19)
!166 = !DILocation(line: 250, column: 19, scope: !159)
!167 = !DILocation(line: 250, column: 19, scope: !165)
!168 = !DILocation(line: 250, column: 24, scope: !159)
!169 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN62_$LT$digest..InvalidOutputSize$u20$as$u20$core..fmt..Debug$GT$3fmt17h4ebdead146dda83bE", scope: !170, file: !106, line: 275, type: !108, scopeLine: 275, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !171)
!170 = !DINamespace(name: "{impl#6}", scope: !24)
!171 = !{!172, !173, !174}
!172 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !106, line: 275, type: !110)
!173 = !DILocalVariable(name: "f", arg: 2, scope: !169, file: !106, line: 275, type: !68)
!174 = !DILocalVariable(name: "debug_trait_builder", scope: !175, file: !106, line: 275, type: !143, align: 8)
!175 = distinct !DILexicalBlock(scope: !169, file: !106, line: 275, column: 23)
!176 = !DILocation(line: 275, column: 23, scope: !169)
!177 = !DILocation(line: 275, column: 23, scope: !175)
!178 = !DILocation(line: 275, column: 28, scope: !169)
!179 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN62_$LT$digest..InvalidBufferSize$u20$as$u20$core..fmt..Debug$GT$3fmt17h097149cf8e49ec5aE", scope: !180, file: !106, line: 289, type: !121, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !50, retainedNodes: !181)
!180 = !DINamespace(name: "{impl#9}", scope: !24)
!181 = !{!182, !183, !184}
!182 = !DILocalVariable(name: "self", arg: 1, scope: !179, file: !106, line: 289, type: !123)
!183 = !DILocalVariable(name: "f", arg: 2, scope: !179, file: !106, line: 289, type: !68)
!184 = !DILocalVariable(name: "debug_trait_builder", scope: !185, file: !106, line: 289, type: !143, align: 8)
!185 = distinct !DILexicalBlock(scope: !179, file: !106, line: 289, column: 19)
!186 = !DILocation(line: 289, column: 19, scope: !179)
!187 = !DILocation(line: 289, column: 19, scope: !185)
!188 = !DILocation(line: 289, column: 24, scope: !179)
