; ModuleID = 'generic_array.6a398ecc-cgu.0'
source_filename = "generic_array.6a398ecc-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }

@alloc434 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc435 = private unnamed_addr constant <{ [74 x i8] }> <{ [74 x i8] c"/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/mod.rs" }>, align 1
@alloc436 = private unnamed_addr constant <{ i8*, [16 x i8] }> <{ i8* getelementptr inbounds (<{ [74 x i8] }>, <{ [74 x i8] }>* @alloc435, i32 0, i32 0, i32 0), [16 x i8] c"J\00\00\00\00\00\00\00c\01\00\00\0D\00\00\00" }>, align 8
@alloc1 = private unnamed_addr constant <{ [16 x i8] }> <{ [16 x i8] c"0123456789abcdef" }>, align 1
@_ZN13generic_array3hex11LOWER_CHARS17hcb973effbbba7f5fE = constant <{ i8*, [8 x i8] }> <{ i8* getelementptr inbounds (<{ [16 x i8] }>, <{ [16 x i8] }>* @alloc1, i32 0, i32 0, i32 0), [8 x i8] c"\10\00\00\00\00\00\00\00" }>, align 8, !dbg !0
@alloc2 = private unnamed_addr constant <{ [16 x i8] }> <{ [16 x i8] c"0123456789ABCDEF" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LOWER_CHARS", linkageName: "_ZN13generic_array3hex11LOWER_CHARS17hcb973effbbba7f5fE", scope: !2, file: !4, line: 24, type: !5, isLocal: false, isDefinition: true, align: 8)
!2 = !DINamespace(name: "hex", scope: !3)
!3 = !DINamespace(name: "generic_array", scope: null)
!4 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5/src/hex.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5", checksumkind: CSK_MD5, checksum: "9251670c091a8b2c0c5958b94dafbab4")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !6, size: 128, align: 64, elements: !7, templateParams: !13, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !{!8, !11}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !5, file: !6, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!10 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !5, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!13 = !{}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "UPPER_CHARS", linkageName: "_ZN13generic_array3hex11UPPER_CHARS17h552e34e6fdc81069E", scope: !2, file: !4, line: 25, type: !5, isLocal: false, isDefinition: true, align: 8)
!16 = !{i32 7, !"PIC Level", i32 2}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !19, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !20, globals: !36)
!19 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5")
!20 = !{!21, !31}
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !22, file: !6, baseType: !10, size: 8, align: 8, flags: DIFlagEnumClass, elements: !26)
!22 = !DINamespace(name: "v1", scope: !23)
!23 = !DINamespace(name: "rt", scope: !24)
!24 = !DINamespace(name: "fmt", scope: !25)
!25 = !DINamespace(name: "core", scope: null)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "Left", value: 0)
!28 = !DIEnumerator(name: "Right", value: 1)
!29 = !DIEnumerator(name: "Center", value: 2)
!30 = !DIEnumerator(name: "Unknown", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !32, file: !6, baseType: !10, size: 8, align: 8, flags: DIFlagEnumClass, elements: !33)
!32 = !DINamespace(name: "result", scope: !25)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "Ok", value: 0)
!35 = !DIEnumerator(name: "Err", value: 1)
!36 = !{!0, !14}
!37 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h7fd20ff9643cb5dfE", scope: !39, file: !38, line: 350, type: !145, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !13, retainedNodes: !147)
!38 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc8dfb4543b7986b6225b25d4f76a5ce")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !24, file: !6, size: 384, align: 64, elements: !40, templateParams: !13, identifier: "503d474dbdb4b9bdcb6335aff8fef947")
!40 = !{!41, !51, !100}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !39, file: !6, baseType: !42, size: 128, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !43, templateParams: !13, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!43 = !{!44, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !42, file: !6, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !47, templateParams: !13, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !46, file: !6, baseType: !9, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !46, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !42, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !39, file: !6, baseType: !52, size: 128, align: 64, offset: 128)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !53, file: !6, size: 128, align: 64, elements: !54, identifier: "397a0ac37bf3530f2da349092773bdb1")
!53 = !DINamespace(name: "option", scope: !25)
!54 = !{!55}
!55 = !DICompositeType(tag: DW_TAG_variant_part, scope: !53, file: !6, size: 128, align: 64, elements: !56, templateParams: !59, identifier: "397a0ac37bf3530f2da349092773bdb1_variant_part", discriminator: !99)
!56 = !{!57, !95}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !55, file: !6, baseType: !58, size: 128, align: 64, extraData: i64 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !52, file: !6, size: 128, align: 64, elements: !13, templateParams: !59, identifier: "397a0ac37bf3530f2da349092773bdb1::None")
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !62, templateParams: !13, identifier: "c45b2a5be65217bea740b1a64f131289")
!62 = !{!63, !94}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !61, file: !6, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Argument", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !22, file: !6, size: 448, align: 64, elements: !66, templateParams: !13, identifier: "be1a2a63eebf5bd46c1acffa2dd6e315")
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !65, file: !6, baseType: !12, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !65, file: !6, baseType: !69, size: 384, align: 64, offset: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !22, file: !6, size: 384, align: 64, elements: !70, templateParams: !13, identifier: "69ce227e4aab17788d1c0f03469b02a7")
!70 = !{!71, !73, !74, !76, !93}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !69, file: !6, baseType: !72, size: 32, align: 32, offset: 256)
!72 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !69, file: !6, baseType: !21, size: 8, align: 8, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !6, baseType: !75, size: 32, align: 32, offset: 288)
!75 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !69, file: !6, baseType: !77, size: 128, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !22, file: !6, size: 128, align: 64, elements: !78, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e")
!78 = !{!79}
!79 = !DICompositeType(tag: DW_TAG_variant_part, scope: !22, file: !6, size: 128, align: 64, elements: !80, templateParams: !13, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e_variant_part", discriminator: !91)
!80 = !{!81, !85, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !79, file: !6, baseType: !82, size: 128, align: 64, extraData: i64 0)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !77, file: !6, size: 128, align: 64, elements: !83, templateParams: !13, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Is")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !79, file: !6, baseType: !86, size: 128, align: 64, extraData: i64 1)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !77, file: !6, size: 128, align: 64, elements: !87, templateParams: !13, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Param")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !86, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !79, file: !6, baseType: !90, size: 128, align: 64, extraData: i64 2)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !77, file: !6, size: 128, align: 64, elements: !13, templateParams: !13, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Implied")
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !22, file: !6, baseType: !92, size: 64, align: 64, flags: DIFlagArtificial)
!92 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !69, file: !6, baseType: !77, size: 128, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !61, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !55, file: !6, baseType: !96, size: 128, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !52, file: !6, size: 128, align: 64, elements: !97, templateParams: !59, identifier: "397a0ac37bf3530f2da349092773bdb1::Some")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !6, baseType: !61, size: 128, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !6, baseType: !92, size: 64, align: 64, flags: DIFlagArtificial)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !39, file: !6, baseType: !101, size: 128, align: 64, offset: 256)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !102, templateParams: !13, identifier: "afd1d87e15705e622b365ca1c27d8ada")
!102 = !{!103, !144}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !101, file: !6, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ArgumentV1", baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !24, file: !6, size: 128, align: 64, elements: !106, templateParams: !13, identifier: "899142106ae236a2208250e894c2e1f5")
!106 = !{!107, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !6, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Opaque", baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !6, align: 8, elements: !13, identifier: "877e2849686608d7fea70d5469669ca4")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !105, file: !6, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DISubroutineType(types: !113)
!113 = !{!31, !108, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !24, file: !6, size: 512, align: 64, elements: !116, templateParams: !13, identifier: "37f4daa474efe0abec93026f6af11d04")
!116 = !{!117, !118, !119, !120, !133, !134}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !6, baseType: !75, size: 32, align: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !115, file: !6, baseType: !72, size: 32, align: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !115, file: !6, baseType: !21, size: 8, align: 8, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !115, file: !6, baseType: !121, size: 128, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !53, file: !6, size: 128, align: 64, elements: !122, identifier: "4849786e80860f5416c4c6b259f5a683")
!122 = !{!123}
!123 = !DICompositeType(tag: DW_TAG_variant_part, scope: !53, file: !6, size: 128, align: 64, elements: !124, templateParams: !127, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !99)
!124 = !{!125, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !123, file: !6, baseType: !126, size: 128, align: 64, extraData: i64 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !121, file: !6, size: 128, align: 64, elements: !13, templateParams: !127, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "T", type: !12)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !123, file: !6, baseType: !130, size: 128, align: 64, extraData: i64 1)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !121, file: !6, size: 128, align: 64, elements: !131, templateParams: !127, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !115, file: !6, baseType: !121, size: 128, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !115, file: !6, baseType: !135, size: 128, align: 64, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !136, templateParams: !13, identifier: "ab0a0458a7bfc4114bcaaa179b3e8910")
!136 = !{!137, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !135, file: !6, baseType: !138, size: 64, align: 64, flags: DIFlagArtificial)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !135, file: !6, baseType: !140, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, align: 64, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 3, lowerBound: 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !101, file: !6, baseType: !12, size: 64, align: 64, offset: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!39, !42, !101}
!147 = !{!148, !149}
!148 = !DILocalVariable(name: "pieces", arg: 1, scope: !37, file: !38, line: 351, type: !42)
!149 = !DILocalVariable(name: "args", arg: 2, scope: !37, file: !38, line: 352, type: !101)
!150 = !DILocation(line: 351, column: 9, scope: !37)
!151 = !DILocation(line: 352, column: 9, scope: !37)
!152 = !DILocation(line: 354, column: 12, scope: !37)
!153 = !DILocation(line: 354, column: 56, scope: !37)
!154 = !DILocation(line: 354, column: 41, scope: !37)
!155 = !{i8 0, i8 2}
!156 = !DILocation(line: 357, column: 34, scope: !37)
!157 = !DILocation(line: 357, column: 9, scope: !37)
!158 = !DILocation(line: 358, column: 6, scope: !37)
!159 = !DILocation(line: 355, column: 13, scope: !37)
!160 = distinct !DISubprogram(name: "from_iter_length_fail", linkageName: "_ZN13generic_array21from_iter_length_fail17h53b7255552a03030E", scope: !3, file: !161, line: 358, type: !162, scopeLine: 358, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !18, templateParams: !13, retainedNodes: !164)
!161 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.5", checksumkind: CSK_MD5, checksum: "e29e6f18caee9ea6991884f1e9f9ebda")
!162 = !DISubroutineType(types: !163)
!163 = !{null, !12, !12}
!164 = !{!165, !166, !167, !172, !173}
!165 = !DILocalVariable(name: "length", arg: 1, scope: !160, file: !161, line: 358, type: !12)
!166 = !DILocalVariable(name: "expected", arg: 2, scope: !160, file: !161, line: 358, type: !12)
!167 = !DILocalVariable(name: "arg0", scope: !168, file: !161, line: 359, type: !171, align: 8)
!168 = !DILexicalBlockFile(scope: !169, file: !161, discriminator: 0)
!169 = distinct !DILexicalBlock(scope: !160, file: !170, line: 34, column: 38)
!170 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "95851010b93c9b57c6fb236c55505626")
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!172 = !DILocalVariable(name: "arg1", scope: !168, file: !161, line: 359, type: !171, align: 8)
!173 = !DILocalVariable(name: "args", scope: !174, file: !161, line: 359, type: !176, align: 8)
!174 = !DILexicalBlockFile(scope: !175, file: !161, discriminator: 0)
!175 = distinct !DILexicalBlock(scope: !160, file: !170, line: 34, column: 38)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[core::fmt::ArgumentV1; 2]", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, align: 64, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 2, lowerBound: 0)
!180 = !DILocation(line: 358, column: 26, scope: !160)
!181 = !DILocation(line: 358, column: 41, scope: !160)
!182 = !DILocation(line: 359, column: 5, scope: !160)
!183 = !DILocation(line: 359, column: 5, scope: !168)
!184 = !DILocation(line: 359, column: 5, scope: !174)
