; ModuleID = 'serde.cb42cc89-cgu.0'
source_filename = "serde.cb42cc89-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"std::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"std::iter::Enumerate<std::slice::Iter<&str>>" = type { { i64*, i64* }, i64 }
%"std::option::Option<std::convert::Infallible>::None" = type {}
%"std::panic::PanicInfo<'a>::internal_constructor::NoPayload" = type {}
%"std::panic::PanicInfo" = type { { {}*, [3 x i64]* }, i64*, %"std::panic::Location"* }
%"std::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"__private::de::content::Content" = type { i8, [31 x i8] }
%"std::string::String" = type { %"std::vec::Vec<u8>" }
%"std::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"std::vec::Vec<__private::de::content::Content>" = type { { i64*, i64 }, i64 }
%"std::vec::Vec<(__private::de::content::Content, __private::de::content::Content)>" = type { { i64*, i64 }, i64 }
%"std::fmt::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"std::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Opaque" = type {}
%"std::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"std::str::Utf8Error" = type { i64, { i8, i8 }, [6 x i8] }
%"std::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!6 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !10, identifier: "vtable")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Content", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Content", scope: !12, file: !2, size: 256, align: 64, elements: !16, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed")
!12 = !DINamespace(name: "content", scope: !13)
!13 = !DINamespace(name: "de", scope: !14)
!14 = !DINamespace(name: "__private", scope: !15)
!15 = !DINamespace(name: "serde", scope: null)
!16 = !{!17}
!17 = !DICompositeType(tag: DW_TAG_variant_part, scope: !12, file: !2, size: 256, align: 64, elements: !18, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed_variant_part", discriminator: !196)
!18 = !{!19, !24, !28, !33, !38, !43, !48, !53, !58, !63, !68, !73, !78, !115, !123, !127, !135, !137, !142, !144, !148, !170}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Bool", scope: !17, file: !2, baseType: !20, size: 256, align: 64, extraData: i64 0)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bool", scope: !11, file: !2, size: 256, align: 64, elements: !21, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Bool")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !20, file: !2, baseType: !23, size: 8, align: 8, offset: 8)
!23 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "U8", scope: !17, file: !2, baseType: !25, size: 256, align: 64, extraData: i64 1)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "U8", scope: !11, file: !2, size: 256, align: 64, elements: !26, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::U8")
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !25, file: !2, baseType: !6, size: 8, align: 8, offset: 8)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "U16", scope: !17, file: !2, baseType: !29, size: 256, align: 64, extraData: i64 2)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "U16", scope: !11, file: !2, size: 256, align: 64, elements: !30, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::U16")
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !29, file: !2, baseType: !32, size: 16, align: 16, offset: 16)
!32 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "U32", scope: !17, file: !2, baseType: !34, size: 256, align: 64, extraData: i64 3)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "U32", scope: !11, file: !2, size: 256, align: 64, elements: !35, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::U32")
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !34, file: !2, baseType: !37, size: 32, align: 32, offset: 32)
!37 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "U64", scope: !17, file: !2, baseType: !39, size: 256, align: 64, extraData: i64 4)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "U64", scope: !11, file: !2, size: 256, align: 64, elements: !40, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::U64")
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !39, file: !2, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "I8", scope: !17, file: !2, baseType: !44, size: 256, align: 64, extraData: i64 5)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "I8", scope: !11, file: !2, size: 256, align: 64, elements: !45, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::I8")
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !44, file: !2, baseType: !47, size: 8, align: 8, offset: 8)
!47 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "I16", scope: !17, file: !2, baseType: !49, size: 256, align: 64, extraData: i64 6)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "I16", scope: !11, file: !2, size: 256, align: 64, elements: !50, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::I16")
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !49, file: !2, baseType: !52, size: 16, align: 16, offset: 16)
!52 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "I32", scope: !17, file: !2, baseType: !54, size: 256, align: 64, extraData: i64 7)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "I32", scope: !11, file: !2, size: 256, align: 64, elements: !55, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::I32")
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !54, file: !2, baseType: !57, size: 32, align: 32, offset: 32)
!57 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "I64", scope: !17, file: !2, baseType: !59, size: 256, align: 64, extraData: i64 8)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "I64", scope: !11, file: !2, size: 256, align: 64, elements: !60, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::I64")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !59, file: !2, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "F32", scope: !17, file: !2, baseType: !64, size: 256, align: 64, extraData: i64 9)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "F32", scope: !11, file: !2, size: 256, align: 64, elements: !65, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::F32")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !2, baseType: !67, size: 32, align: 32, offset: 32)
!67 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "F64", scope: !17, file: !2, baseType: !69, size: 256, align: 64, extraData: i64 10)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "F64", scope: !11, file: !2, size: 256, align: 64, elements: !70, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::F64")
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !69, file: !2, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !17, file: !2, baseType: !74, size: 256, align: 64, extraData: i64 11)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !11, file: !2, size: 256, align: 64, elements: !75, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Char")
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !74, file: !2, baseType: !77, size: 32, align: 32, offset: 32)
!77 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "String", scope: !17, file: !2, baseType: !79, size: 256, align: 64, extraData: i64 12)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !11, file: !2, size: 256, align: 64, elements: !80, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::String")
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !79, file: !2, baseType: !82, size: 192, align: 64, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !83, file: !2, size: 192, align: 64, elements: !85, templateParams: !4, identifier: "96eaa147e4cb6ee42e5dcd78906547cd")
!83 = !DINamespace(name: "string", scope: !84)
!84 = !DINamespace(name: "alloc", scope: null)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !82, file: !2, baseType: !87, size: 192, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !88, file: !2, size: 192, align: 64, elements: !89, templateParams: !112, identifier: "56aa0380f8224c92be7dc99cfce9180f")
!88 = !DINamespace(name: "vec", scope: !84)
!89 = !{!90, !114}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !87, file: !2, baseType: !91, size: 128, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !92, file: !2, size: 128, align: 64, elements: !93, templateParams: !112, identifier: "47ed2282bf82d40f2b2c1ebc77e9f331")
!92 = !DINamespace(name: "raw_vec", scope: !84)
!93 = !{!94, !107, !109}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, file: !2, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !96, file: !2, size: 64, align: 64, elements: !99, templateParams: !105, identifier: "76ad11c5918345b022d81965d637386")
!96 = !DINamespace(name: "unique", scope: !97)
!97 = !DINamespace(name: "ptr", scope: !98)
!98 = !DINamespace(name: "core", scope: null)
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !95, file: !2, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !95, file: !2, baseType: !103, align: 8)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !104, file: !2, align: 8, elements: !4, templateParams: !105, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!104 = !DINamespace(name: "marker", scope: !98)
!105 = !{!106}
!106 = !DITemplateTypeParameter(name: "T", type: !6)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !91, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !91, file: !2, baseType: !110, align: 8)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !111, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!111 = !DINamespace(name: "alloc", scope: !84)
!112 = !{!106, !113}
!113 = !DITemplateTypeParameter(name: "A", type: !110)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !2, baseType: !108, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !17, file: !2, baseType: !116, size: 256, align: 64, extraData: i64 13)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Str", scope: !11, file: !2, size: 256, align: 64, elements: !117, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Str")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !116, file: !2, baseType: !119, size: 128, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !120, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !119, file: !2, baseType: !101, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !119, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ByteBuf", scope: !17, file: !2, baseType: !124, size: 256, align: 64, extraData: i64 14)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteBuf", scope: !11, file: !2, size: 256, align: 64, elements: !125, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::ByteBuf")
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !124, file: !2, baseType: !87, size: 192, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", scope: !17, file: !2, baseType: !128, size: 256, align: 64, extraData: i64 15)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !11, file: !2, size: 256, align: 64, elements: !129, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Bytes")
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !128, file: !2, baseType: !131, size: 128, align: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !132, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !131, file: !2, baseType: !101, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !131, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !17, file: !2, baseType: !136, size: 256, align: 64, extraData: i64 16)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !11, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::None")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !17, file: !2, baseType: !138, size: 256, align: 64, extraData: i64 17)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !11, file: !2, size: 256, align: 64, elements: !139, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Some")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<serde::__private::de::content::Content, alloc::alloc::Global>", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Unit", scope: !17, file: !2, baseType: !143, size: 256, align: 64, extraData: i64 18)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unit", scope: !11, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Unit")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Newtype", scope: !17, file: !2, baseType: !145, size: 256, align: 64, extraData: i64 19)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Newtype", scope: !11, file: !2, size: 256, align: 64, elements: !146, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Newtype")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !145, file: !2, baseType: !141, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", scope: !17, file: !2, baseType: !149, size: 256, align: 64, extraData: i64 20)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Seq", scope: !11, file: !2, size: 256, align: 64, elements: !150, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Seq")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !149, file: !2, baseType: !152, size: 192, align: 64, offset: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<serde::__private::de::content::Content, alloc::alloc::Global>", scope: !88, file: !2, size: 192, align: 64, elements: !153, templateParams: !168, identifier: "735b9b270075149b764ff0c4b970fc16")
!153 = !{!154, !169}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !152, file: !2, baseType: !155, size: 128, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<serde::__private::de::content::Content, alloc::alloc::Global>", scope: !92, file: !2, size: 128, align: 64, elements: !156, templateParams: !168, identifier: "ffaa29dba2ecee3d90dabb21862e8a0e")
!156 = !{!157, !166, !167}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !155, file: !2, baseType: !158, size: 64, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<serde::__private::de::content::Content>", scope: !96, file: !2, size: 64, align: 64, elements: !159, templateParams: !164, identifier: "f589ce238be5fb11ea6f18c9b6e74bb4")
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !158, file: !2, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Content", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !158, file: !2, baseType: !163, align: 8)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<serde::__private::de::content::Content>", scope: !104, file: !2, align: 8, elements: !4, templateParams: !164, identifier: "5f480c7351a5d4d05fc44e93ae678314")
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "T", type: !11)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !155, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !155, file: !2, baseType: !110, align: 8)
!168 = !{!165, !113}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !152, file: !2, baseType: !108, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Map", scope: !17, file: !2, baseType: !171, size: 256, align: 64, extraData: i64 21)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map", scope: !11, file: !2, size: 256, align: 64, elements: !172, templateParams: !4, identifier: "2c48fdc5672c1a4e26e23cd66ffcffed::Map")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !2, baseType: !174, size: 192, align: 64, offset: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(serde::__private::de::content::Content, serde::__private::de::content::Content), alloc::alloc::Global>", scope: !88, file: !2, size: 192, align: 64, elements: !175, templateParams: !194, identifier: "2fd0c1bcc8f5a3e9ac52119980ecda70")
!175 = !{!176, !195}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !174, file: !2, baseType: !177, size: 128, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(serde::__private::de::content::Content, serde::__private::de::content::Content), alloc::alloc::Global>", scope: !92, file: !2, size: 128, align: 64, elements: !178, templateParams: !194, identifier: "7b1935ff79e6504ba54573f58ab68408")
!178 = !{!179, !192, !193}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !177, file: !2, baseType: !180, size: 64, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<(serde::__private::de::content::Content, serde::__private::de::content::Content)>", scope: !96, file: !2, size: 64, align: 64, elements: !181, templateParams: !190, identifier: "52a96a2475a4ccc32f6c9f021d03ca09")
!181 = !{!182, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !180, file: !2, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const (serde::__private::de::content::Content, serde::__private::de::content::Content)", baseType: !184, size: 64, align: 64, dwarfAddressSpace: 0)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "(serde::__private::de::content::Content, serde::__private::de::content::Content)", file: !2, size: 512, align: 64, elements: !185, templateParams: !4, identifier: "e143e230dfcc2c20a0cc9953276c1cd")
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !184, file: !2, baseType: !11, size: 256, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !184, file: !2, baseType: !11, size: 256, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !180, file: !2, baseType: !189, align: 8)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(serde::__private::de::content::Content, serde::__private::de::content::Content)>", scope: !104, file: !2, align: 8, elements: !4, templateParams: !190, identifier: "67414d618cadb58888e7c25be55ce44e")
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !184)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !177, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !177, file: !2, baseType: !110, align: 8)
!194 = !{!191, !113}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !174, file: !2, baseType: !108, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !12, file: !2, baseType: !6, size: 8, align: 8, flags: DIFlagArtificial)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !200, identifier: "vtable")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(serde::__private::de::content::Content, serde::__private::de::content::Content)", baseType: !184, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !204, identifier: "vtable")
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoPayload", scope: !205, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "62c95ed097f3a273d24d56b8c417dfd8")
!205 = !DINamespace(name: "internal_constructor", scope: !206)
!206 = !DINamespace(name: "{impl#0}", scope: !207)
!207 = !DINamespace(name: "panic_info", scope: !208)
!208 = !DINamespace(name: "panic", scope: !98)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !212, identifier: "vtable")
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !213, file: !2, size: 128, align: 64, elements: !215, templateParams: !4, identifier: "23e62222a878f93eb05b6b1bf847e978")
!213 = !DINamespace(name: "error", scope: !214)
!214 = !DINamespace(name: "str", scope: !98)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !212, file: !2, baseType: !108, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !212, file: !2, baseType: !218, size: 16, align: 8, offset: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !219, file: !2, size: 16, align: 8, elements: !220, identifier: "b8190189d3b92788fb333a57bdc50a8b")
!219 = !DINamespace(name: "option", scope: !98)
!220 = !{!221}
!221 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, size: 16, align: 8, elements: !222, templateParams: !105, identifier: "b8190189d3b92788fb333a57bdc50a8b_variant_part", discriminator: !229)
!222 = !{!223, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !221, file: !2, baseType: !224, size: 16, align: 8, extraData: i64 0)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !218, file: !2, size: 16, align: 8, elements: !4, templateParams: !105, identifier: "b8190189d3b92788fb333a57bdc50a8b::None")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !221, file: !2, baseType: !226, size: 16, align: 8, extraData: i64 1)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !218, file: !2, size: 16, align: 8, elements: !227, templateParams: !105, identifier: "b8190189d3b92788fb333a57bdc50a8b::Some")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !226, file: !2, baseType: !6, size: 8, align: 8, offset: 8)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !2, baseType: !6, size: 8, align: 8, flags: DIFlagArtificial)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !233, identifier: "vtable")
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !234, templateParams: !237, identifier: "fa312df8562c9e21539015dc100ef193")
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !233, file: !2, baseType: !101, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !233, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!237 = !{!238, !113}
!238 = !DITemplateTypeParameter(name: "T", type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, align: 8, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: -1, lowerBound: 0)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "NANOS_PER_SEC", linkageName: "_ZN5serde2de5impls73_$LT$impl$u20$serde..de..Deserialize$u20$for$u20$core..time..Duration$GT$11deserialize14check_overflow13NANOS_PER_SEC17hc49dee4d4092dcc9E", scope: !244, file: !249, line: 2029, type: !37, isLocal: false, isDefinition: true, align: 4)
!244 = !DINamespace(name: "check_overflow", scope: !245)
!245 = !DINamespace(name: "deserialize", scope: !246)
!246 = !DINamespace(name: "{impl#31}", scope: !247)
!247 = !DINamespace(name: "impls", scope: !248)
!248 = !DINamespace(name: "de", scope: !15)
!249 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/serde-1.0.136/src/de/impls.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/serde-1.0.136", checksumkind: CSK_MD5, checksum: "f45a34d77d933aed4a7bd32860f16262")
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "NANOS_PER_SEC", linkageName: "_ZN5serde2de5impls74_$LT$impl$u20$serde..de..Deserialize$u20$for$u20$std..time..SystemTime$GT$11deserialize14check_overflow13NANOS_PER_SEC17he1d4f07a664b4ac6E", scope: !252, file: !249, line: 2167, type: !37, isLocal: false, isDefinition: true, align: 4)
!252 = !DINamespace(name: "check_overflow", scope: !253)
!253 = !DINamespace(name: "deserialize", scope: !254)
!254 = !DINamespace(name: "{impl#32}", scope: !247)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "VARIANTS", linkageName: "_ZN5serde2de5impls73_$LT$impl$u20$serde..de..Deserialize$u20$for$u20$std..net..ip..IpAddr$GT$11deserialize8VARIANTS17h03f37bb1022986b4E", scope: !257, file: !249, line: 1452, type: !259, isLocal: false, isDefinition: true, align: 8)
!257 = !DINamespace(name: "deserialize", scope: !258)
!258 = !DINamespace(name: "{impl#23}", scope: !247)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !260, templateParams: !4, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !259, file: !2, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !259, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "VARIANTS", linkageName: "_ZN5serde2de5impls79_$LT$impl$u20$serde..de..Deserialize$u20$for$u20$std..net..addr..SocketAddr$GT$11deserialize8VARIANTS17h7c84d04a7e3d6b91E", scope: !266, file: !249, line: 1452, type: !259, isLocal: false, isDefinition: true, align: 8)
!266 = !DINamespace(name: "deserialize", scope: !267)
!267 = !DINamespace(name: "{impl#24}", scope: !247)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !271, identifier: "vtable")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !275, identifier: "vtable")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u8]", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !279, identifier: "vtable")
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&char", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !283, identifier: "vtable")
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !287, identifier: "vtable")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !291, identifier: "vtable")
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !295, identifier: "vtable")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !299, identifier: "vtable")
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Vec<(serde::__private::de::content::Content, serde::__private::de::content::Content), alloc::alloc::Global>", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !303, identifier: "vtable")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Vec<serde::__private::de::content::Content, alloc::alloc::Global>", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !307, identifier: "vtable")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Box<serde::__private::de::content::Content, alloc::alloc::Global>", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !311, identifier: "vtable")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Vec<u8, alloc::alloc::Global>", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !315, identifier: "vtable")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&String", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !319, identifier: "vtable")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !323, identifier: "vtable")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !327, identifier: "vtable")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i16", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !331, identifier: "vtable")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i8", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !335, identifier: "vtable")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !339, identifier: "vtable")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !{i32 7, !"PIC Level", i32 2}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !343, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, globals: !375)
!343 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/serde-1.0.136/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/serde-1.0.136")
!344 = !{!345, !354, !359}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !346, file: !2, baseType: !6, size: 8, align: 8, flags: DIFlagEnumClass, elements: !349)
!346 = !DINamespace(name: "v1", scope: !347)
!347 = !DINamespace(name: "rt", scope: !348)
!348 = !DINamespace(name: "fmt", scope: !98)
!349 = !{!350, !351, !352, !353}
!350 = !DIEnumerator(name: "Left", value: 0)
!351 = !DIEnumerator(name: "Right", value: 1)
!352 = !DIEnumerator(name: "Center", value: 2)
!353 = !DIEnumerator(name: "Unknown", value: 3)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !355, file: !2, baseType: !6, size: 8, align: 8, flags: DIFlagEnumClass, elements: !356)
!355 = !DINamespace(name: "result", scope: !98)
!356 = !{!357, !358}
!357 = !DIEnumerator(name: "Ok", value: 0)
!358 = !DIEnumerator(name: "Err", value: 1)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Unsupported", scope: !360, file: !2, baseType: !6, size: 8, align: 8, flags: DIFlagEnumClass, elements: !361)
!360 = !DINamespace(name: "ser", scope: !14)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!362 = !DIEnumerator(name: "Boolean", value: 0)
!363 = !DIEnumerator(name: "Integer", value: 1)
!364 = !DIEnumerator(name: "Float", value: 2)
!365 = !DIEnumerator(name: "Char", value: 3)
!366 = !DIEnumerator(name: "String", value: 4)
!367 = !DIEnumerator(name: "ByteArray", value: 5)
!368 = !DIEnumerator(name: "Optional", value: 6)
!369 = !DIEnumerator(name: "Unit", value: 7)
!370 = !DIEnumerator(name: "UnitStruct", value: 8)
!371 = !DIEnumerator(name: "Sequence", value: 9)
!372 = !DIEnumerator(name: "Tuple", value: 10)
!373 = !DIEnumerator(name: "TupleStruct", value: 11)
!374 = !DIEnumerator(name: "Enum", value: 12)
!375 = !{!0, !7, !197, !201, !209, !230, !242, !250, !255, !264, !268, !272, !276, !280, !284, !288, !292, !296, !300, !304, !308, !312, !316, !320, !324, !328, !332, !336}
!376 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h1e154e9a9b8e8595E", scope: !378, file: !377, line: 219, type: !381, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !395)
!377 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "a82bc19197b1c05f8386d5b2ec2441bd")
!378 = !DINamespace(name: "{impl#3}", scope: !379)
!379 = !DINamespace(name: "index", scope: !380)
!380 = !DINamespace(name: "slice", scope: !98)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !387, !383}
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !384, templateParams: !4, identifier: "f5bc56280f62752aca6114f169d6965e")
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !383, file: !2, baseType: !101, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !383, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !388, file: !2, size: 128, align: 64, elements: !390, templateParams: !393, identifier: "519e5ef7586dbc9eb7e108f1b1bab509")
!388 = !DINamespace(name: "range", scope: !389)
!389 = !DINamespace(name: "ops", scope: !98)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !387, file: !2, baseType: !108, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !387, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!393 = !{!394}
!394 = !DITemplateTypeParameter(name: "Idx", type: !108)
!395 = !{!396, !397}
!396 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !377, line: 219, type: !387)
!397 = !DILocalVariable(name: "slice", arg: 2, scope: !376, file: !377, line: 219, type: !383)
!398 = !DILocation(line: 219, column: 29, scope: !376)
!399 = !DILocation(line: 219, column: 35, scope: !376)
!400 = !DILocation(line: 224, column: 44, scope: !376)
!401 = !DILocalVariable(name: "self", arg: 1, scope: !402, file: !403, line: 511, type: !101)
!402 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17he060af8b3c00c187E", scope: !404, file: !403, line: 511, type: !406, scopeLine: 511, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !408)
!403 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "d3efc72e5c37c5202bb58c77289e8c38")
!404 = !DINamespace(name: "{impl#0}", scope: !405)
!405 = !DINamespace(name: "const_ptr", scope: !97)
!406 = !DISubroutineType(types: !407)
!407 = !{!101, !101, !108}
!408 = !{!401, !409}
!409 = !DILocalVariable(name: "count", arg: 2, scope: !402, file: !403, line: 511, type: !108)
!410 = !DILocation(line: 511, column: 29, scope: !402, inlinedAt: !411)
!411 = distinct !DILocation(line: 224, column: 44, scope: !376)
!412 = !DILocation(line: 511, column: 35, scope: !402, inlinedAt: !411)
!413 = !DILocalVariable(name: "self", arg: 1, scope: !414, file: !403, line: 230, type: !101)
!414 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h85582c2af5e94d37E", scope: !404, file: !403, line: 230, type: !415, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !418)
!415 = !DISubroutineType(types: !416)
!416 = !{!101, !101, !417}
!417 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!418 = !{!413, !419}
!419 = !DILocalVariable(name: "count", arg: 2, scope: !414, file: !403, line: 230, type: !417)
!420 = !DILocation(line: 230, column: 32, scope: !414, inlinedAt: !421)
!421 = distinct !DILocation(line: 516, column: 18, scope: !402, inlinedAt: !411)
!422 = !DILocation(line: 230, column: 38, scope: !414, inlinedAt: !421)
!423 = !DILocation(line: 235, column: 18, scope: !414, inlinedAt: !421)
!424 = !DILocation(line: 224, column: 76, scope: !376)
!425 = !DILocation(line: 224, column: 18, scope: !376)
!426 = !DILocation(line: 225, column: 6, scope: !376)
!427 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h45ccb0f9ba6dd7cfE", scope: !378, file: !377, line: 228, type: !428, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !434)
!428 = !DISubroutineType(types: !429)
!429 = !{!430, !387, !430}
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !431, templateParams: !4, identifier: "5196b2ee1fdbf734c7f3a78e14d50170")
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !430, file: !2, baseType: !101, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !430, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!434 = !{!435, !436}
!435 = !DILocalVariable(name: "self", arg: 1, scope: !427, file: !377, line: 228, type: !387)
!436 = !DILocalVariable(name: "slice", arg: 2, scope: !427, file: !377, line: 228, type: !430)
!437 = !DILocation(line: 228, column: 33, scope: !427)
!438 = !DILocation(line: 228, column: 39, scope: !427)
!439 = !DILocalVariable(name: "self", arg: 1, scope: !440, file: !441, line: 1197, type: !430)
!440 = distinct !DISubprogram(name: "as_mut_ptr<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17hf615a9de3af2762eE", scope: !442, file: !441, line: 1197, type: !444, scopeLine: 1197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !447)
!441 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "dc9433fa5edb0740532b3ed97e3aaa10")
!442 = !DINamespace(name: "{impl#1}", scope: !443)
!443 = !DINamespace(name: "mut_ptr", scope: !97)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !430}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !{!439}
!448 = !DILocation(line: 1197, column: 29, scope: !440, inlinedAt: !449)
!449 = distinct !DILocation(line: 231, column: 43, scope: !427)
!450 = !DILocation(line: 1198, column: 9, scope: !440, inlinedAt: !449)
!451 = !DILocation(line: 231, column: 43, scope: !427)
!452 = !DILocalVariable(name: "self", arg: 1, scope: !453, file: !441, line: 618, type: !446)
!453 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17haac5faae9fee4651E", scope: !454, file: !441, line: 618, type: !455, scopeLine: 618, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !457)
!454 = !DINamespace(name: "{impl#0}", scope: !443)
!455 = !DISubroutineType(types: !456)
!456 = !{!446, !446, !108}
!457 = !{!452, !458}
!458 = !DILocalVariable(name: "count", arg: 2, scope: !453, file: !441, line: 618, type: !108)
!459 = !DILocation(line: 618, column: 29, scope: !453, inlinedAt: !460)
!460 = distinct !DILocation(line: 231, column: 43, scope: !427)
!461 = !DILocation(line: 618, column: 35, scope: !453, inlinedAt: !460)
!462 = !DILocalVariable(name: "self", arg: 1, scope: !463, file: !441, line: 235, type: !446)
!463 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h245c1da1fae07bccE", scope: !454, file: !441, line: 235, type: !464, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!446, !446, !417}
!466 = !{!462, !467}
!467 = !DILocalVariable(name: "count", arg: 2, scope: !463, file: !441, line: 235, type: !417)
!468 = !DILocation(line: 235, column: 32, scope: !463, inlinedAt: !469)
!469 = distinct !DILocation(line: 623, column: 18, scope: !453, inlinedAt: !460)
!470 = !DILocation(line: 235, column: 38, scope: !463, inlinedAt: !469)
!471 = !DILocation(line: 242, column: 18, scope: !463, inlinedAt: !469)
!472 = !DILocation(line: 231, column: 79, scope: !427)
!473 = !DILocation(line: 231, column: 13, scope: !427)
!474 = !DILocation(line: 233, column: 6, scope: !427)
!475 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h9679a6310e63ac22E", scope: !378, file: !377, line: 236, type: !476, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !485)
!476 = !DISubroutineType(types: !477)
!477 = !{!131, !387, !131, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Location", baseType: !479, size: 64, align: 64, dwarfAddressSpace: 0)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !480, file: !2, size: 192, align: 64, elements: !481, templateParams: !4, identifier: "9f9749776572719cc82f4bbe4f5eb8d")
!480 = !DINamespace(name: "location", scope: !208)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !479, file: !2, baseType: !119, size: 128, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !479, file: !2, baseType: !37, size: 32, align: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !479, file: !2, baseType: !37, size: 32, align: 32, offset: 160)
!485 = !{!486, !487}
!486 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !377, line: 236, type: !387)
!487 = !DILocalVariable(name: "slice", arg: 2, scope: !475, file: !377, line: 236, type: !131)
!488 = !DILocation(line: 236, column: 14, scope: !475)
!489 = !DILocation(line: 236, column: 20, scope: !475)
!490 = !DILocation(line: 237, column: 12, scope: !475)
!491 = !DILocation(line: 239, column: 19, scope: !475)
!492 = !DILocation(line: 238, column: 13, scope: !475)
!493 = !DILocation(line: 243, column: 20, scope: !475)
!494 = !DILocation(line: 240, column: 13, scope: !475)
!495 = !DILocation(line: 244, column: 6, scope: !475)
!496 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h84e1749aec4d5716E", scope: !378, file: !377, line: 247, type: !497, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !503)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !387, !499, !478}
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !500, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !499, file: !2, baseType: !101, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !499, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!503 = !{!504, !505}
!504 = !DILocalVariable(name: "self", arg: 1, scope: !496, file: !377, line: 247, type: !387)
!505 = !DILocalVariable(name: "slice", arg: 2, scope: !496, file: !377, line: 247, type: !499)
!506 = !DILocation(line: 247, column: 18, scope: !496)
!507 = !DILocation(line: 247, column: 24, scope: !496)
!508 = !DILocation(line: 248, column: 12, scope: !496)
!509 = !DILocation(line: 250, column: 19, scope: !496)
!510 = !DILocation(line: 249, column: 13, scope: !496)
!511 = !DILocation(line: 254, column: 24, scope: !496)
!512 = !DILocation(line: 251, column: 13, scope: !496)
!513 = !DILocation(line: 255, column: 6, scope: !496)
!514 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h48886fa6578103f5E", scope: !515, file: !377, line: 285, type: !516, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !521)
!515 = !DINamespace(name: "{impl#4}", scope: !379)
!516 = !DISubroutineType(types: !517)
!517 = !{!131, !518, !131, !478}
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !388, file: !2, size: 64, align: 64, elements: !519, templateParams: !393, identifier: "3e48b56f3047a6495d250669d7a4f287")
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !518, file: !2, baseType: !108, size: 64, align: 64)
!521 = !{!522, !523}
!522 = !DILocalVariable(name: "self", arg: 1, scope: !514, file: !377, line: 285, type: !518)
!523 = !DILocalVariable(name: "slice", arg: 2, scope: !514, file: !377, line: 285, type: !131)
!524 = !DILocation(line: 285, column: 14, scope: !514)
!525 = !DILocation(line: 285, column: 20, scope: !514)
!526 = !DILocation(line: 286, column: 9, scope: !514)
!527 = !DILocation(line: 287, column: 6, scope: !514)
!528 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<&str>>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h27048e7e523eb4a9E", scope: !530, file: !529, line: 45, type: !534, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !573, retainedNodes: !575)
!529 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c34b678724f0d255a70ef8e29773480")
!530 = !DINamespace(name: "{impl#1}", scope: !531)
!531 = !DINamespace(name: "enumerate", scope: !532)
!532 = !DINamespace(name: "adapters", scope: !533)
!533 = !DINamespace(name: "iter", scope: !98)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !553}
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, &&str)>", scope: !219, file: !2, size: 128, align: 64, elements: !537, identifier: "ec07e17f037613458f441d9da166c296")
!537 = !{!538}
!538 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, size: 128, align: 64, elements: !539, templateParams: !542, identifier: "ec07e17f037613458f441d9da166c296_variant_part", discriminator: !552)
!539 = !{!540, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !538, file: !2, baseType: !541, size: 128, align: 64, extraData: i64 0)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !536, file: !2, size: 128, align: 64, elements: !4, templateParams: !542, identifier: "ec07e17f037613458f441d9da166c296::None")
!542 = !{!543}
!543 = !DITemplateTypeParameter(name: "T", type: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &&str)", file: !2, size: 128, align: 64, elements: !545, templateParams: !4, identifier: "eaa77ef0ab29af1d82b6f26a1bf137ce")
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !2, baseType: !108, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !544, file: !2, baseType: !271, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !538, file: !2, baseType: !549, size: 128, align: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !536, file: !2, size: 128, align: 64, elements: !550, templateParams: !542, identifier: "ec07e17f037613458f441d9da166c296::Some")
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !549, file: !2, baseType: !544, size: 128, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !2, baseType: !42, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Enumerate<core::slice::iter::Iter<&str>>", baseType: !554, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::Iter<&str>>", scope: !531, file: !2, size: 192, align: 64, elements: !555, templateParams: !573, identifier: "56f6eaf6fc135e43387821869ba983aa")
!555 = !{!556, !572}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !554, file: !2, baseType: !557, size: 128, align: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !558, file: !2, size: 128, align: 64, elements: !559, templateParams: !565, identifier: "3777ffedd3a0b92589c48390525c0eea")
!558 = !DINamespace(name: "iter", scope: !380)
!559 = !{!560, !567, !568}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !557, file: !2, baseType: !561, size: 64, align: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !562, file: !2, size: 64, align: 64, elements: !563, templateParams: !565, identifier: "9bdda3955565479650f1b965e5a7f07f")
!562 = !DINamespace(name: "non_null", scope: !97)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !561, file: !2, baseType: !262, size: 64, align: 64)
!565 = !{!566}
!566 = !DITemplateTypeParameter(name: "T", type: !119)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !557, file: !2, baseType: !262, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !557, file: !2, baseType: !569, align: 8)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !104, file: !2, align: 8, elements: !4, templateParams: !570, identifier: "2312e3a961fce1e229b01cf1faed2e76")
!570 = !{!571}
!571 = !DITemplateTypeParameter(name: "T", type: !271)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !554, file: !2, baseType: !108, size: 64, align: 64, offset: 128)
!573 = !{!574}
!574 = !DITemplateTypeParameter(name: "I", type: !557)
!575 = !{!576, !577, !579, !593, !595}
!576 = !DILocalVariable(name: "self", arg: 1, scope: !528, file: !529, line: 45, type: !553)
!577 = !DILocalVariable(name: "a", scope: !578, file: !529, line: 46, type: !271, align: 8)
!578 = distinct !DILexicalBlock(scope: !528, file: !529, line: 46, column: 9)
!579 = !DILocalVariable(name: "residual", scope: !580, file: !529, line: 46, type: !581, align: 1)
!580 = distinct !DILexicalBlock(scope: !528, file: !529, line: 46, column: 33)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !219, file: !2, align: 8, elements: !582, identifier: "69e681f2568c3113446c36892492605a")
!582 = !{!583}
!583 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, align: 8, elements: !584, templateParams: !587, identifier: "69e681f2568c3113446c36892492605a_variant_part")
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !583, file: !2, baseType: !586, align: 8)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !581, file: !2, align: 8, elements: !4, templateParams: !587, identifier: "69e681f2568c3113446c36892492605a::None")
!587 = !{!588}
!588 = !DITemplateTypeParameter(name: "T", type: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !590, file: !2, align: 8, elements: !591, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!590 = !DINamespace(name: "convert", scope: !98)
!591 = !{!592}
!592 = !DICompositeType(tag: DW_TAG_variant_part, scope: !590, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!593 = !DILocalVariable(name: "val", scope: !594, file: !529, line: 46, type: !271, align: 8)
!594 = distinct !DILexicalBlock(scope: !528, file: !529, line: 46, column: 17)
!595 = !DILocalVariable(name: "i", scope: !596, file: !529, line: 47, type: !108, align: 8)
!596 = distinct !DILexicalBlock(scope: !578, file: !529, line: 47, column: 9)
!597 = !DILocation(line: 45, column: 13, scope: !528)
!598 = !DILocation(line: 46, column: 33, scope: !580)
!599 = !DILocation(line: 46, column: 17, scope: !528)
!600 = !DILocation(line: 46, column: 17, scope: !594)
!601 = !DILocation(line: 46, column: 13, scope: !578)
!602 = !DILocation(line: 47, column: 17, scope: !578)
!603 = !DILocation(line: 47, column: 13, scope: !596)
!604 = !DILocation(line: 48, column: 9, scope: !596)
!605 = !DILocation(line: 46, column: 17, scope: !580)
!606 = !DILocation(line: 50, column: 6, scope: !528)
!607 = !DILocation(line: 49, column: 14, scope: !596)
!608 = !DILocation(line: 49, column: 9, scope: !596)
!609 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h36cff02d6364f337E", scope: !610, file: !377, line: 310, type: !611, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !616)
!610 = !DINamespace(name: "{impl#5}", scope: !379)
!611 = !DISubroutineType(types: !612)
!612 = !{!383, !613, !383}
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !388, file: !2, size: 64, align: 64, elements: !614, templateParams: !393, identifier: "e075dc6e7a89d0be4297c8fc5af78aa")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !613, file: !2, baseType: !108, size: 64, align: 64)
!616 = !{!617, !618}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !609, file: !377, line: 310, type: !613)
!618 = !DILocalVariable(name: "slice", arg: 2, scope: !609, file: !377, line: 310, type: !383)
!619 = !DILocation(line: 310, column: 29, scope: !609)
!620 = !DILocation(line: 310, column: 35, scope: !609)
!621 = !DILocation(line: 312, column: 31, scope: !609)
!622 = !DILocation(line: 312, column: 18, scope: !609)
!623 = !DILocation(line: 313, column: 6, scope: !609)
!624 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h933154bc541785e0E", scope: !610, file: !377, line: 322, type: !625, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!131, !613, !131, !478}
!627 = !{!628, !629}
!628 = !DILocalVariable(name: "self", arg: 1, scope: !624, file: !377, line: 322, type: !613)
!629 = !DILocalVariable(name: "slice", arg: 2, scope: !624, file: !377, line: 322, type: !131)
!630 = !DILocation(line: 322, column: 14, scope: !624)
!631 = !DILocation(line: 322, column: 20, scope: !624)
!632 = !DILocation(line: 323, column: 12, scope: !624)
!633 = !DILocation(line: 327, column: 20, scope: !624)
!634 = !DILocation(line: 324, column: 13, scope: !624)
!635 = !DILocation(line: 328, column: 6, scope: !624)
!636 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17h7ad0de09b6496756E", scope: !638, file: !637, line: 690, type: !639, scopeLine: 690, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !644)
!637 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "c5d45e507157c14ac9b8f7e5ac0abc2b")
!638 = !DINamespace(name: "{impl#16}", scope: !562)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !95}
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !562, file: !2, size: 64, align: 64, elements: !642, templateParams: !105, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !641, file: !2, baseType: !101, size: 64, align: 64)
!644 = !{!645}
!645 = !DILocalVariable(name: "unique", arg: 1, scope: !636, file: !637, line: 690, type: !95)
!646 = !DILocation(line: 690, column: 13, scope: !636)
!647 = !DILocation(line: 693, column: 41, scope: !636)
!648 = !DILocation(line: 693, column: 18, scope: !636)
!649 = !DILocation(line: 694, column: 6, scope: !636)
!650 = distinct !DISubprogram(name: "type_id<core::panic::panic_info::{impl#0}::internal_constructor::NoPayload>", linkageName: "_ZN36_$LT$T$u20$as$u20$core..any..Any$GT$7type_id17h13c2de4f00268f61E", scope: !652, file: !651, line: 133, type: !654, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !662, retainedNodes: !660)
!651 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/any.rs", directory: "", checksumkind: CSK_MD5, checksum: "2c8dba47a5060f511f627cde0934be05")
!652 = !DINamespace(name: "{impl#0}", scope: !653)
!653 = !DINamespace(name: "any", scope: !98)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !659}
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !653, file: !2, size: 64, align: 64, elements: !657, templateParams: !4, identifier: "c41d611025883ac3518ca2acbe7522f7")
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !656, file: !2, baseType: !42, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&NoPayload", baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!660 = !{!661}
!661 = !DILocalVariable(name: "self", arg: 1, scope: !650, file: !651, line: 133, type: !659)
!662 = !{!663}
!663 = !DITemplateTypeParameter(name: "T", type: !204)
!664 = !DILocation(line: 133, column: 16, scope: !650)
!665 = !DILocation(line: 134, column: 9, scope: !650)
!666 = !DILocation(line: 135, column: 6, scope: !650)
!667 = distinct !DISubprogram(name: "begin_panic<&str>", linkageName: "_ZN3std9panicking11begin_panic17h72b14a97cded58e1E", scope: !669, file: !668, line: 790, type: !671, scopeLine: 790, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !791, retainedNodes: !673)
!668 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/std/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "9a21f51a0de463767e90eea7a94f5329")
!669 = !DINamespace(name: "panicking", scope: !670)
!670 = !DINamespace(name: "std", scope: null)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !119, !478}
!673 = !{!674, !675}
!674 = !DILocalVariable(name: "_msg", arg: 1, scope: !667, file: !668, line: 790, type: !119)
!675 = !DILocalVariable(name: "info", scope: !676, file: !668, line: 791, type: !677, align: 8)
!676 = distinct !DILexicalBlock(scope: !667, file: !668, line: 791, column: 5)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !207, file: !2, size: 256, align: 64, elements: !678, templateParams: !4, identifier: "4a04907f18776341a0ae17404e205d06")
!678 = !{!679, !688, !790}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !677, file: !2, baseType: !680, size: 128, align: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !681, templateParams: !4, identifier: "383db8294e4b3ea47f6b628b3841b65c")
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !680, file: !2, baseType: !446, size: 64, align: 64, flags: DIFlagArtificial)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !680, file: !2, baseType: !684, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !685, size: 64, align: 64, dwarfAddressSpace: 0)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 192, align: 64, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 3, lowerBound: 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !677, file: !2, baseType: !689, size: 64, align: 64, offset: 128)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !219, file: !2, size: 64, align: 64, elements: !690, identifier: "5f11674a8ad885214fc20997bca247b8")
!690 = !{!691}
!691 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, size: 64, align: 64, elements: !692, templateParams: !695, identifier: "5f11674a8ad885214fc20997bca247b8_variant_part", discriminator: !745)
!692 = !{!693, !786}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !691, file: !2, baseType: !694, size: 64, align: 64, extraData: i64 0)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !689, file: !2, size: 64, align: 64, elements: !4, templateParams: !695, identifier: "5f11674a8ad885214fc20997bca247b8::None")
!695 = !{!696}
!696 = !DITemplateTypeParameter(name: "T", type: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Arguments", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !348, file: !2, size: 384, align: 64, elements: !699, templateParams: !4, identifier: "503d474dbdb4b9bdcb6335aff8fef947")
!699 = !{!700, !701, !746}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !698, file: !2, baseType: !259, size: 128, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !698, file: !2, baseType: !702, size: 128, align: 64, offset: 128)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !219, file: !2, size: 128, align: 64, elements: !703, identifier: "397a0ac37bf3530f2da349092773bdb1")
!703 = !{!704}
!704 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, size: 128, align: 64, elements: !705, templateParams: !708, identifier: "397a0ac37bf3530f2da349092773bdb1_variant_part", discriminator: !745)
!705 = !{!706, !741}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !704, file: !2, baseType: !707, size: 128, align: 64, extraData: i64 0)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !702, file: !2, size: 128, align: 64, elements: !4, templateParams: !708, identifier: "397a0ac37bf3530f2da349092773bdb1::None")
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "T", type: !710)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !711, templateParams: !4, identifier: "c45b2a5be65217bea740b1a64f131289")
!711 = !{!712, !740}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !710, file: !2, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Argument", baseType: !714, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !346, file: !2, size: 448, align: 64, elements: !715, templateParams: !4, identifier: "be1a2a63eebf5bd46c1acffa2dd6e315")
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !714, file: !2, baseType: !108, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !714, file: !2, baseType: !718, size: 384, align: 64, offset: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !346, file: !2, size: 384, align: 64, elements: !719, templateParams: !4, identifier: "69ce227e4aab17788d1c0f03469b02a7")
!719 = !{!720, !721, !722, !723, !739}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !718, file: !2, baseType: !77, size: 32, align: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !718, file: !2, baseType: !345, size: 8, align: 8, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !2, baseType: !37, size: 32, align: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !718, file: !2, baseType: !724, size: 128, align: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !346, file: !2, size: 128, align: 64, elements: !725, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e")
!725 = !{!726}
!726 = !DICompositeType(tag: DW_TAG_variant_part, scope: !346, file: !2, size: 128, align: 64, elements: !727, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e_variant_part", discriminator: !738)
!727 = !{!728, !732, !736}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !726, file: !2, baseType: !729, size: 128, align: 64, extraData: i64 0)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !724, file: !2, size: 128, align: 64, elements: !730, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Is")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !726, file: !2, baseType: !733, size: 128, align: 64, extraData: i64 1)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !724, file: !2, size: 128, align: 64, elements: !734, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Param")
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !733, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !726, file: !2, baseType: !737, size: 128, align: 64, extraData: i64 2)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !724, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Implied")
!738 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !2, baseType: !42, size: 64, align: 64, flags: DIFlagArtificial)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !718, file: !2, baseType: !724, size: 128, align: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !710, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !704, file: !2, baseType: !742, size: 128, align: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !702, file: !2, size: 128, align: 64, elements: !743, templateParams: !708, identifier: "397a0ac37bf3530f2da349092773bdb1::Some")
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !742, file: !2, baseType: !710, size: 128, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !2, baseType: !42, size: 64, align: 64, flags: DIFlagArtificial)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !698, file: !2, baseType: !747, size: 128, align: 64, offset: 256)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !748, templateParams: !4, identifier: "afd1d87e15705e622b365ca1c27d8ada")
!748 = !{!749, !785}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !747, file: !2, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ArgumentV1", baseType: !751, size: 64, align: 64, dwarfAddressSpace: 0)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !348, file: !2, size: 128, align: 64, elements: !752, templateParams: !4, identifier: "899142106ae236a2208250e894c2e1f5")
!752 = !{!753, !756}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !751, file: !2, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Opaque", baseType: !755, size: 64, align: 64, dwarfAddressSpace: 0)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !4, identifier: "877e2849686608d7fea70d5469669ca4")
!756 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !751, file: !2, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !758, size: 64, align: 64, dwarfAddressSpace: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!354, !754, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !761, size: 64, align: 64, dwarfAddressSpace: 0)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !348, file: !2, size: 512, align: 64, elements: !762, templateParams: !4, identifier: "37f4daa474efe0abec93026f6af11d04")
!762 = !{!763, !764, !765, !766, !779, !780}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !2, baseType: !37, size: 32, align: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !761, file: !2, baseType: !77, size: 32, align: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !761, file: !2, baseType: !345, size: 8, align: 8, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !761, file: !2, baseType: !767, size: 128, align: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !219, file: !2, size: 128, align: 64, elements: !768, identifier: "4849786e80860f5416c4c6b259f5a683")
!768 = !{!769}
!769 = !DICompositeType(tag: DW_TAG_variant_part, scope: !219, file: !2, size: 128, align: 64, elements: !770, templateParams: !773, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !745)
!770 = !{!771, !775}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !769, file: !2, baseType: !772, size: 128, align: 64, extraData: i64 0)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !767, file: !2, size: 128, align: 64, elements: !4, templateParams: !773, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!773 = !{!774}
!774 = !DITemplateTypeParameter(name: "T", type: !108)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !769, file: !2, baseType: !776, size: 128, align: 64, extraData: i64 1)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !767, file: !2, size: 128, align: 64, elements: !777, templateParams: !773, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !776, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !761, file: !2, baseType: !767, size: 128, align: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !761, file: !2, baseType: !781, size: 128, align: 64, offset: 256)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !782, templateParams: !4, identifier: "ab0a0458a7bfc4114bcaaa179b3e8910")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !781, file: !2, baseType: !446, size: 64, align: 64, flags: DIFlagArtificial)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !781, file: !2, baseType: !684, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !747, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !691, file: !2, baseType: !787, size: 64, align: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !689, file: !2, size: 64, align: 64, elements: !788, templateParams: !695, identifier: "5f11674a8ad885214fc20997bca247b8::Some")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !2, baseType: !697, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !677, file: !2, baseType: !478, size: 64, align: 64, offset: 192)
!791 = !{!792}
!792 = !DITemplateTypeParameter(name: "M", type: !119)
!793 = !DILocation(line: 790, column: 35, scope: !667)
!794 = !DILocation(line: 791, column: 9, scope: !676)
!795 = !DILocation(line: 792, column: 9, scope: !667)
!796 = !DILocation(line: 793, column: 9, scope: !667)
!797 = !DILocation(line: 791, column: 16, scope: !667)
!798 = !DILocation(line: 795, column: 5, scope: !676)
!799 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17hc3dfc7a2b007f8f2E", scope: !801, file: !800, line: 2117, type: !802, scopeLine: 2117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !4, retainedNodes: !804)
!800 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc8dfb4543b7986b6225b25d4f76a5ce")
!801 = !DINamespace(name: "{impl#13}", scope: !348)
!802 = !DISubroutineType(types: !803)
!803 = !{!354, !295, !760}
!804 = !{!805, !806}
!805 = !DILocalVariable(name: "self", arg: 1, scope: !799, file: !800, line: 2117, type: !295)
!806 = !DILocalVariable(name: "f", arg: 2, scope: !799, file: !800, line: 2117, type: !760)
!807 = !DILocation(line: 2117, column: 12, scope: !799)
!808 = !DILocation(line: 2117, column: 19, scope: !799)
!809 = !DILocation(line: 2118, column: 9, scope: !799)
!810 = !DILocation(line: 2119, column: 6, scope: !799)
!811 = distinct !DISubprogram(name: "fmt<u16>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h1d3cf7202c8a852dE", scope: !812, file: !800, line: 2088, type: !813, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !819, retainedNodes: !816)
!812 = !DINamespace(name: "{impl#51}", scope: !348)
!813 = !DISubroutineType(types: !814)
!814 = !{!354, !815, !760}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u16", baseType: !339, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !{!817, !818}
!817 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !800, line: 2088, type: !815)
!818 = !DILocalVariable(name: "f", arg: 2, scope: !811, file: !800, line: 2088, type: !760)
!819 = !{!820}
!820 = !DITemplateTypeParameter(name: "T", type: !32)
!821 = !DILocation(line: 2088, column: 20, scope: !811)
!822 = !DILocation(line: 2088, column: 27, scope: !811)
!823 = !DILocation(line: 2088, column: 71, scope: !811)
!824 = !DILocation(line: 2088, column: 62, scope: !811)
!825 = !DILocation(line: 2088, column: 84, scope: !811)
!826 = distinct !DISubprogram(name: "fmt<serde::__private::de::content::Content>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h2c36573f7bf064f4E", scope: !812, file: !800, line: 2088, type: !827, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !164, retainedNodes: !830)
!827 = !DISubroutineType(types: !828)
!828 = !{!354, !829, !760}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&Content", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!830 = !{!831, !832}
!831 = !DILocalVariable(name: "self", arg: 1, scope: !826, file: !800, line: 2088, type: !829)
!832 = !DILocalVariable(name: "f", arg: 2, scope: !826, file: !800, line: 2088, type: !760)
!833 = !DILocation(line: 2088, column: 20, scope: !826)
!834 = !DILocation(line: 2088, column: 27, scope: !826)
!835 = !DILocation(line: 2088, column: 71, scope: !826)
!836 = !DILocation(line: 2088, column: 62, scope: !826)
!837 = !DILocation(line: 2088, column: 84, scope: !826)
!838 = distinct !DISubprogram(name: "fmt<i16>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h2f7d3768a209f56bE", scope: !812, file: !800, line: 2088, type: !839, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !845, retainedNodes: !842)
!839 = !DISubroutineType(types: !840)
!840 = !{!354, !841, !760}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i16", baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!842 = !{!843, !844}
!843 = !DILocalVariable(name: "self", arg: 1, scope: !838, file: !800, line: 2088, type: !841)
!844 = !DILocalVariable(name: "f", arg: 2, scope: !838, file: !800, line: 2088, type: !760)
!845 = !{!846}
!846 = !DITemplateTypeParameter(name: "T", type: !52)
!847 = !DILocation(line: 2088, column: 20, scope: !838)
!848 = !DILocation(line: 2088, column: 27, scope: !838)
!849 = !DILocation(line: 2088, column: 71, scope: !838)
!850 = !DILocation(line: 2088, column: 62, scope: !838)
!851 = !DILocation(line: 2088, column: 84, scope: !838)
!852 = distinct !DISubprogram(name: "fmt<bool>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3bf70a878feb4fc2E", scope: !812, file: !800, line: 2088, type: !853, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !859, retainedNodes: !856)
!853 = !DISubroutineType(types: !854)
!854 = !{!354, !855, !760}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bool", baseType: !295, size: 64, align: 64, dwarfAddressSpace: 0)
!856 = !{!857, !858}
!857 = !DILocalVariable(name: "self", arg: 1, scope: !852, file: !800, line: 2088, type: !855)
!858 = !DILocalVariable(name: "f", arg: 2, scope: !852, file: !800, line: 2088, type: !760)
!859 = !{!860}
!860 = !DITemplateTypeParameter(name: "T", type: !23)
!861 = !DILocation(line: 2088, column: 20, scope: !852)
!862 = !DILocation(line: 2088, column: 27, scope: !852)
!863 = !DILocation(line: 2088, column: 71, scope: !852)
!864 = !DILocation(line: 2088, column: 62, scope: !852)
!865 = !DILocation(line: 2088, column: 84, scope: !852)
!866 = distinct !DISubprogram(name: "fmt<i64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3ef87fef260d65f9E", scope: !812, file: !800, line: 2088, type: !867, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !873, retainedNodes: !870)
!867 = !DISubroutineType(types: !868)
!868 = !{!354, !869, !760}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i64", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!870 = !{!871, !872}
!871 = !DILocalVariable(name: "self", arg: 1, scope: !866, file: !800, line: 2088, type: !869)
!872 = !DILocalVariable(name: "f", arg: 2, scope: !866, file: !800, line: 2088, type: !760)
!873 = !{!874}
!874 = !DITemplateTypeParameter(name: "T", type: !62)
!875 = !DILocation(line: 2088, column: 20, scope: !866)
!876 = !DILocation(line: 2088, column: 27, scope: !866)
!877 = !DILocation(line: 2088, column: 71, scope: !866)
!878 = !DILocation(line: 2088, column: 62, scope: !866)
!879 = !DILocation(line: 2088, column: 84, scope: !866)
!880 = distinct !DISubprogram(name: "fmt<char>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h43eab52cafaf518cE", scope: !812, file: !800, line: 2088, type: !881, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !887, retainedNodes: !884)
!881 = !DISubroutineType(types: !882)
!882 = !{!354, !883, !760}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&char", baseType: !279, size: 64, align: 64, dwarfAddressSpace: 0)
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "self", arg: 1, scope: !880, file: !800, line: 2088, type: !883)
!886 = !DILocalVariable(name: "f", arg: 2, scope: !880, file: !800, line: 2088, type: !760)
!887 = !{!888}
!888 = !DITemplateTypeParameter(name: "T", type: !77)
!889 = !DILocation(line: 2088, column: 20, scope: !880)
!890 = !DILocation(line: 2088, column: 27, scope: !880)
!891 = !DILocation(line: 2088, column: 71, scope: !880)
!892 = !DILocation(line: 2088, column: 62, scope: !880)
!893 = !DILocation(line: 2088, column: 84, scope: !880)
!894 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h558dc96ad6f3107eE", scope: !812, file: !800, line: 2088, type: !895, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !105, retainedNodes: !898)
!895 = !DISubroutineType(types: !896)
!896 = !{!354, !897, !760}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u8", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!898 = !{!899, !900}
!899 = !DILocalVariable(name: "self", arg: 1, scope: !894, file: !800, line: 2088, type: !897)
!900 = !DILocalVariable(name: "f", arg: 2, scope: !894, file: !800, line: 2088, type: !760)
!901 = !DILocation(line: 2088, column: 20, scope: !894)
!902 = !DILocation(line: 2088, column: 27, scope: !894)
!903 = !DILocation(line: 2088, column: 71, scope: !894)
!904 = !DILocation(line: 2088, column: 62, scope: !894)
!905 = !DILocation(line: 2088, column: 84, scope: !894)
!906 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h55a9969ecbbe3f1aE", scope: !812, file: !800, line: 2088, type: !907, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !913, retainedNodes: !910)
!907 = !DISubroutineType(types: !908)
!908 = !{!354, !909, !760}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !335, size: 64, align: 64, dwarfAddressSpace: 0)
!910 = !{!911, !912}
!911 = !DILocalVariable(name: "self", arg: 1, scope: !906, file: !800, line: 2088, type: !909)
!912 = !DILocalVariable(name: "f", arg: 2, scope: !906, file: !800, line: 2088, type: !760)
!913 = !{!914}
!914 = !DITemplateTypeParameter(name: "T", type: !37)
!915 = !DILocation(line: 2088, column: 20, scope: !906)
!916 = !DILocation(line: 2088, column: 27, scope: !906)
!917 = !DILocation(line: 2088, column: 71, scope: !906)
!918 = !DILocation(line: 2088, column: 62, scope: !906)
!919 = !DILocation(line: 2088, column: 84, scope: !906)
!920 = distinct !DISubprogram(name: "fmt<f32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h5f1cc39867dd35efE", scope: !812, file: !800, line: 2088, type: !921, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !927, retainedNodes: !924)
!921 = !DISubroutineType(types: !922)
!922 = !{!354, !923, !760}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f32", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!924 = !{!925, !926}
!925 = !DILocalVariable(name: "self", arg: 1, scope: !920, file: !800, line: 2088, type: !923)
!926 = !DILocalVariable(name: "f", arg: 2, scope: !920, file: !800, line: 2088, type: !760)
!927 = !{!928}
!928 = !DITemplateTypeParameter(name: "T", type: !67)
!929 = !DILocation(line: 2088, column: 20, scope: !920)
!930 = !DILocation(line: 2088, column: 27, scope: !920)
!931 = !DILocation(line: 2088, column: 71, scope: !920)
!932 = !DILocation(line: 2088, column: 62, scope: !920)
!933 = !DILocation(line: 2088, column: 84, scope: !920)
!934 = distinct !DISubprogram(name: "fmt<alloc::string::String>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h692bfbc5d975befeE", scope: !812, file: !800, line: 2088, type: !935, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !941, retainedNodes: !938)
!935 = !DISubroutineType(types: !936)
!936 = !{!354, !937, !760}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&String", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!938 = !{!939, !940}
!939 = !DILocalVariable(name: "self", arg: 1, scope: !934, file: !800, line: 2088, type: !937)
!940 = !DILocalVariable(name: "f", arg: 2, scope: !934, file: !800, line: 2088, type: !760)
!941 = !{!942}
!942 = !DITemplateTypeParameter(name: "T", type: !82)
!943 = !DILocation(line: 2088, column: 20, scope: !934)
!944 = !DILocation(line: 2088, column: 27, scope: !934)
!945 = !DILocation(line: 2088, column: 71, scope: !934)
!946 = !DILocation(line: 2088, column: 62, scope: !934)
!947 = !DILocation(line: 2088, column: 84, scope: !934)
!948 = distinct !DISubprogram(name: "fmt<i8>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6bf957a242ae2450E", scope: !812, file: !800, line: 2088, type: !949, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !955, retainedNodes: !952)
!949 = !DISubroutineType(types: !950)
!950 = !{!354, !951, !760}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i8", baseType: !331, size: 64, align: 64, dwarfAddressSpace: 0)
!952 = !{!953, !954}
!953 = !DILocalVariable(name: "self", arg: 1, scope: !948, file: !800, line: 2088, type: !951)
!954 = !DILocalVariable(name: "f", arg: 2, scope: !948, file: !800, line: 2088, type: !760)
!955 = !{!956}
!956 = !DITemplateTypeParameter(name: "T", type: !47)
!957 = !DILocation(line: 2088, column: 20, scope: !948)
!958 = !DILocation(line: 2088, column: 27, scope: !948)
!959 = !DILocation(line: 2088, column: 71, scope: !948)
!960 = !DILocation(line: 2088, column: 62, scope: !948)
!961 = !DILocation(line: 2088, column: 84, scope: !948)
!962 = distinct !DISubprogram(name: "fmt<alloc::vec::Vec<serde::__private::de::content::Content, alloc::alloc::Global>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h775add4b74de4b4dE", scope: !812, file: !800, line: 2088, type: !963, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !969, retainedNodes: !966)
!963 = !DISubroutineType(types: !964)
!964 = !{!354, !965, !760}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&Vec<serde::__private::de::content::Content, alloc::alloc::Global>", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!966 = !{!967, !968}
!967 = !DILocalVariable(name: "self", arg: 1, scope: !962, file: !800, line: 2088, type: !965)
!968 = !DILocalVariable(name: "f", arg: 2, scope: !962, file: !800, line: 2088, type: !760)
!969 = !{!970}
!970 = !DITemplateTypeParameter(name: "T", type: !152)
!971 = !DILocation(line: 2088, column: 20, scope: !962)
!972 = !DILocation(line: 2088, column: 27, scope: !962)
!973 = !DILocation(line: 2088, column: 71, scope: !962)
!974 = !DILocation(line: 2088, column: 62, scope: !962)
!975 = !DILocation(line: 2088, column: 84, scope: !962)
!976 = distinct !DISubprogram(name: "fmt<&[u8]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7ce330956e3a8d90E", scope: !812, file: !800, line: 2088, type: !977, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !983, retainedNodes: !980)
!977 = !DISubroutineType(types: !978)
!978 = !{!354, !979, !760}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&&[u8]", baseType: !275, size: 64, align: 64, dwarfAddressSpace: 0)
!980 = !{!981, !982}
!981 = !DILocalVariable(name: "self", arg: 1, scope: !976, file: !800, line: 2088, type: !979)
!982 = !DILocalVariable(name: "f", arg: 2, scope: !976, file: !800, line: 2088, type: !760)
!983 = !{!984}
!984 = !DITemplateTypeParameter(name: "T", type: !131)
!985 = !DILocation(line: 2088, column: 20, scope: !976)
!986 = !DILocation(line: 2088, column: 27, scope: !976)
!987 = !DILocation(line: 2088, column: 71, scope: !976)
!988 = !DILocation(line: 2088, column: 62, scope: !976)
!989 = !DILocation(line: 2088, column: 84, scope: !976)
!990 = distinct !DISubprogram(name: "fmt<(serde::__private::de::content::Content, serde::__private::de::content::Content)>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7d4bbb40682a2bd8E", scope: !812, file: !800, line: 2088, type: !991, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !342, templateParams: !190, retainedNodes: !994)
!991 = !DISubroutineType(types: !992)
!992 = !{!354, !993, !760}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&(serde::__private::de::content::Content, serde::__private::de::content::Content)", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!994 = !{!995, !996}
!995 = !DILocalVariable(name: "self", arg: 1, scope: !990, file: !800, line: 2088, type: !993)
!996 = !DILocalVariable(name: "f", arg: 2, scope: !990, file: !800, line: 2088, type: !760)
!997 = !DILocation(line: 2088, column: 20, scope: !990)
!998 = !DILocation(line: 2088, column: 27, scope: !990)
!999 = !DILocation(line: 2088, column: 71, scope: !990)
!1000 = !DILocation(line: 2088, column: 62, scope: !990)
!1001 = !DILocation(line: 2088, column: 84, scope: !990)
