; ModuleID = 'typenum.c022744a-cgu.0'
source_filename = "typenum.c022744a-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"bit::B0" = type {}
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::DebugTuple" = type { %"core::fmt::Formatter"*, i64, i8, i8, [6 x i8] }
%"bit::B1" = type {}
%"int::Z0" = type {}
%"array::ATerm" = type {}
%Greater = type {}
%Less = type {}
%Equal = type {}
%"uint::UTerm" = type {}

@alloc307 = private unnamed_addr constant <{ [2 x i8] }> <{ [2 x i8] c"B0" }>, align 1
@alloc308 = private unnamed_addr constant <{ [2 x i8] }> <{ [2 x i8] c"B1" }>, align 1
@alloc309 = private unnamed_addr constant <{ [2 x i8] }> <{ [2 x i8] c"Z0" }>, align 1
@alloc310 = private unnamed_addr constant <{ [5 x i8] }> <{ [5 x i8] c"ATerm" }>, align 1
@alloc311 = private unnamed_addr constant <{ [7 x i8] }> <{ [7 x i8] c"Greater" }>, align 1
@alloc312 = private unnamed_addr constant <{ [4 x i8] }> <{ [4 x i8] c"Less" }>, align 1
@alloc313 = private unnamed_addr constant <{ [5 x i8] }> <{ [5 x i8] c"Equal" }>, align 1
@alloc314 = private unnamed_addr constant <{ [5 x i8] }> <{ [5 x i8] c"UTerm" }>, align 1

; <typenum::bit::B0 as core::fmt::Debug>::fmt
; Function Attrs: nounwind

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !3, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!3 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0/src/lib.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !7, file: !6, baseType: !9, size: 8, align: 8, flags: DIFlagEnumClass, elements: !10)
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "result", scope: !8)
!8 = !DINamespace(name: "core", scope: null)
!9 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "Ok", value: 0)
!12 = !DIEnumerator(name: "Err", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !14, file: !6, baseType: !9, size: 8, align: 8, flags: DIFlagEnumClass, elements: !17)
!14 = !DINamespace(name: "v1", scope: !15)
!15 = !DINamespace(name: "rt", scope: !16)
!16 = !DINamespace(name: "fmt", scope: !8)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "Left", value: 0)
!19 = !DIEnumerator(name: "Right", value: 1)
!20 = !DIEnumerator(name: "Center", value: 2)
!21 = !DIEnumerator(name: "Unknown", value: 3)
!22 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN53_$LT$typenum..bit..B0$u20$as$u20$core..fmt..Debug$GT$3fmt17h924f1ab902aba0efE", scope: !24, file: !23, line: 18, type: !27, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !31, retainedNodes: !68)
!23 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0/src/bit.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0", checksumkind: CSK_MD5, checksum: "ce05ac724096ae3b1a3fa6dcdef3f681")
!24 = !DINamespace(name: "{impl#40}", scope: !25)
!25 = !DINamespace(name: "bit", scope: !26)
!26 = !DINamespace(name: "typenum", scope: null)
!27 = !DISubroutineType(types: !28)
!28 = !{!5, !29, !32}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&B0", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "B0", scope: !25, file: !6, align: 8, elements: !31, templateParams: !31, identifier: "17f1a8bad085c4426d0a336484dc5acc")
!31 = !{}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !16, file: !6, size: 512, align: 64, elements: !34, templateParams: !31, identifier: "37f4daa474efe0abec93026f6af11d04")
!34 = !{!35, !37, !39, !40, !57, !58}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !6, baseType: !36, size: 32, align: 32, offset: 384)
!36 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !33, file: !6, baseType: !38, size: 32, align: 32, offset: 416)
!38 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !33, file: !6, baseType: !13, size: 8, align: 8, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !6, baseType: !41, size: 128, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !42, file: !6, size: 128, align: 64, elements: !43, identifier: "4849786e80860f5416c4c6b259f5a683")
!42 = !DINamespace(name: "option", scope: !8)
!43 = !{!44}
!44 = !DICompositeType(tag: DW_TAG_variant_part, scope: !42, file: !6, size: 128, align: 64, elements: !45, templateParams: !48, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !55)
!45 = !{!46, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !44, file: !6, baseType: !47, size: 128, align: 64, extraData: i64 0)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !41, file: !6, size: 128, align: 64, elements: !31, templateParams: !48, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "T", type: !50)
!50 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !44, file: !6, baseType: !52, size: 128, align: 64, extraData: i64 1)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !41, file: !6, size: 128, align: 64, elements: !53, templateParams: !48, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !52, file: !6, baseType: !50, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !6, baseType: !56, size: 64, align: 64, flags: DIFlagArtificial)
!56 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !33, file: !6, baseType: !41, size: 128, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !6, baseType: !59, size: 128, align: 64, offset: 256)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !60, templateParams: !31, identifier: "ab0a0458a7bfc4114bcaaa179b3e8910")
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !59, file: !6, baseType: !62, size: 64, align: 64, flags: DIFlagArtificial)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !59, file: !6, baseType: !64, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, align: 64, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3, lowerBound: 0)
!68 = !{!69, !70, !71}
!69 = !DILocalVariable(name: "self", arg: 1, scope: !22, file: !23, line: 18, type: !29)
!70 = !DILocalVariable(name: "f", arg: 2, scope: !22, file: !23, line: 18, type: !32)
!71 = !DILocalVariable(name: "debug_trait_builder", scope: !72, file: !23, line: 18, type: !73, align: 8)
!72 = distinct !DILexicalBlock(scope: !22, file: !23, line: 18, column: 61)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut DebugTuple", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugTuple", scope: !75, file: !6, size: 192, align: 64, elements: !76, templateParams: !31, identifier: "b87e16a2b5c8e5fbfa596aeab6e7643")
!75 = !DINamespace(name: "builders", scope: !16)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !74, file: !6, baseType: !32, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !74, file: !6, baseType: !5, size: 8, align: 8, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !74, file: !6, baseType: !50, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "empty_name", scope: !74, file: !6, baseType: !81, size: 8, align: 8, offset: 136)
!81 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!82 = !DILocation(line: 18, column: 61, scope: !22)
!83 = !DILocation(line: 18, column: 61, scope: !72)
!84 = !DILocation(line: 18, column: 66, scope: !22)
!85 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN53_$LT$typenum..bit..B1$u20$as$u20$core..fmt..Debug$GT$3fmt17h0266f835bea0bbaaE", scope: !86, file: !23, line: 31, type: !87, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !31, retainedNodes: !91)
!86 = !DINamespace(name: "{impl#51}", scope: !25)
!87 = !DISubroutineType(types: !88)
!88 = !{!5, !89, !32}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&B1", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "B1", scope: !25, file: !6, align: 8, elements: !31, templateParams: !31, identifier: "8ccc6567864b02ac7daf355f41f198f2")
!91 = !{!92, !93, !94}
!92 = !DILocalVariable(name: "self", arg: 1, scope: !85, file: !23, line: 31, type: !89)
!93 = !DILocalVariable(name: "f", arg: 2, scope: !85, file: !23, line: 31, type: !32)
!94 = !DILocalVariable(name: "debug_trait_builder", scope: !95, file: !23, line: 31, type: !73, align: 8)
!95 = distinct !DILexicalBlock(scope: !85, file: !23, line: 31, column: 61)
!96 = !DILocation(line: 31, column: 61, scope: !85)
!97 = !DILocation(line: 31, column: 61, scope: !95)
!98 = !DILocation(line: 31, column: 66, scope: !85)
!99 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN53_$LT$typenum..int..Z0$u20$as$u20$core..fmt..Debug$GT$3fmt17h8ac366d4f1598c87E", scope: !101, file: !100, line: 70, type: !103, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !31, retainedNodes: !107)
!100 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0/src/int.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0", checksumkind: CSK_MD5, checksum: "e67fe43ce98273a47f9b8320a934f054")
!101 = !DINamespace(name: "{impl#132}", scope: !102)
!102 = !DINamespace(name: "int", scope: !26)
!103 = !DISubroutineType(types: !104)
!104 = !{!5, !105, !32}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Z0", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "Z0", scope: !102, file: !6, align: 8, elements: !31, templateParams: !31, identifier: "cd7f8259237fce8530ad0228f2962df1")
!107 = !{!108, !109, !110}
!108 = !DILocalVariable(name: "self", arg: 1, scope: !99, file: !100, line: 70, type: !105)
!109 = !DILocalVariable(name: "f", arg: 2, scope: !99, file: !100, line: 70, type: !32)
!110 = !DILocalVariable(name: "debug_trait_builder", scope: !111, file: !100, line: 70, type: !73, align: 8)
!111 = distinct !DILexicalBlock(scope: !99, file: !100, line: 70, column: 61)
!112 = !DILocation(line: 70, column: 61, scope: !99)
!113 = !DILocation(line: 70, column: 61, scope: !111)
!114 = !DILocation(line: 70, column: 66, scope: !99)
!115 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN58_$LT$typenum..array..ATerm$u20$as$u20$core..fmt..Debug$GT$3fmt17h52d88155e92bade3E", scope: !117, file: !116, line: 10, type: !119, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, templateParams: !31, retainedNodes: !123)
!116 = !DIFile(filename: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0/src/array.rs", directory: "/home/seaceved/.cargo/registry/src/github.com-1ecc6299db9ec823/typenum-1.15.0", checksumkind: CSK_MD5, checksum: "4848dbfe446aecb558466dbf51df9799")
!117 = !DINamespace(name: "{impl#33}", scope: !118)
!118 = !DINamespace(name: "array", scope: !26)
!119 = !DISubroutineType(types: !120)
!120 = !{!5, !121, !32}
